# -*- coding: latin-1 -*-
import numpy as np
import sys
from collections import deque

fc1_weight_shape = (128, 24)
fc1_weight = '''壈循崿惦悩彪慅廹悿廼恩彔徴師恓憃庴怸惃怃憀峄性弙恧幤愜抱恒惘彡强忢悝彬愘悠悅愪恠恎庳忂憏忮扬怅德忝懆尛憿彑忺彫悎惍怍忧廼扏恋彥徖庮慏弌恔慥拌廷幻忪归帆戕搱忘嶇平庻彆怙彖庸忓抿悰怶惵彜庽幪屗惫愙往很嶁幁怩徱恓恑怇怭弮惜征悀庩弸復徢悹忠彭扶惑恢惙悔垨搄愿惇惯恇怬徒恼悍恮徥愆廍恃悐幹恨弳得彳慶憠怗廐徙愹忙捸悘彿恈徫怇悒忖必廖恮恇床忾恅挜憘弝愎幒形廵恮廼悇忍忽怆恈怈憯憮忚彦悊悠忡怪徠扩慍恹忿怊斘廒愯怎彈弅必惀弌忦患惞悾広惼廮惡惏徖幚徎弩恛慑揅悁忍廀忪惪巒惁憗悆悯怋恰徑悟慬役很徿巁惚惚恥後峊慠慞愒彙归愫徱廚恮慲忠幙怵廎座慂愝愱恛怹恳彈弦悯彙憎彸恶帔嶱愯嶤惇恓悜忈徚彧忓弗恒徽忳愫徣悱廦恐桓恾悱念怼忦忍怒怙怾忥忳慟廹情恚弢愶弧悆悖庒愗忾彬屶惝悳恓恾怭惻悼帲忸截徜忿恦恔怕惺帪徇徇憏恞悤悸悝恔怢愆徑惬张忐慩忒廲忆慳想愺悜惃懹徿応嶄怗恤惥怱怋彑忢慶我愽录弚廯影憚徳应愛徨待庇恢弶嶆憐强憧慱彐巎恮忽怈择恈悘恬恪怮慨愪府平庝峜彉彧慀恤庢彈彦惨惷彂怵慰弴忟懈忑帑慘庮慐彜悍情慄弁幱徥恗婃干幣恍帠悽廐徏彚怔恥忍很忲怾怍您幣徺彤憠怓惇惱惔恹徫恢忡悒慭忺忔弛惇惕弞怈忬彇愀慶悛抙徃幠廁惆嵾慬彏年忦悾彑恊恃形怠忩彼廐彮徟性惸惜捣廋恘憐惌憦徂惏惷彲恳態彿憍愢惙庡悞廾慖悞惄慊慜捩愕总憏廫律徰徚徯廔弪惿怜悈弝恈循徭慂弽彧庪廆幧扲慬彄愰怐捨庫弘恐嶖惿忝徬愁彙廤忊撵弗恌廑恠廳彦峂従庨惣忽拟恸廝彖懵怣扩忊弧彳怬恸憽愐彚徔幬廨悎岺庵幹張愍廞帹庾徐恉御悩恁庖弌惺恜庻恆憐庠怊愗廨抬惭廽徿张徭悖恱庀弅愒愦悭怼忠幱彎徰恿愉征愚悛总悋恐廀忒怪岥嵻慵恕建忹徟彿憇愄憴忦帩弡愾怍憍庈憆嬼惕悃娟徤廜廮怱忣悒徬忮悙愔悷憷廛悦庻惊庶式弾幽嬠怔庿怅悁戣庮愻弅怈彲徬惙愫愨張怠幡恁恨度廢庹庱扉庇悜徬從惿惵忻忂度恓庐恀帰応彨従徫恊惉底彮彝慒愨慪後心恝扊徹廬彤怐徯惓悉徿悙忪恮庩庺慗恆怆弘彑昷悐幭忬徍巀惭往慀徃廯徠彎惵得彭怅廩心憎惎憋慯徰悷庀庥很得德戔強弆徳廙忑徐惹彿幼怊庝彔悇悆度慺怌摻愧廹怜彭扚庿巇彙惠役徆徤悠徿彗快戧恜徴悷平怎庪地徿律怴怡扭弊掹怭弤彁悈怾快怕怦怨慳悠愂庻彠庥恒媾愶徺忛恕廋廩床怷憷彌嶊悎忎彼恣恶戕幩情悵悝忰怭嫀恝惙弍帪庄弜恐憥悊憵御慞弢慑庪愜惍庞幦悠悂怂悫忋恻恅慝怼恌愨巍悯挳徼庒彻弇彌常恽担悡庥愴恚廲必巒恆忋怙必彈彬悊恺怈悉怕徝恃怓嬙嵛敦彶想廱幟從应悏悔恎弡愺嵦彩愖摔徧徠怋応恴徠廆态愵恭彶恝征庌弉慁弍慜扇恟恊廘战怕愲延幍惊忸恴徣弮撫庛彋徔庲幟悦岩廘廜慁感廥扥弗怑悟惇惧幃惴愱意忓帻庘徒怾徶建惢掣恣恕慾徟悊懀怼廟徝庅怳悿徔怒慳庰彆忺後悮彀彻徂敷幪恫弇惃岁徘憱弑徏愆弽慈役恌愩忉巡怯忮徵忺恄憞愅怂恎悀怣愈徦悸惥徇惉悳彶弾徦惉恦峺弡愞弮悬惂愷柊忘愵廉忙彯怅嶠待戻廨悯想廔徻悏悅扌慨怐徼徲徐怍嶟愀徦徽悥怇廲帞恤彲恬彑愦怞悠彪惾忼恔意慁幣弋惣枈庳忌悦情掦廅戀徨巴憢懵悬廷弥恟怲徔庌忦惱恽恪惑嶏廕徝慤忄慸当念徖悦惧彲彮廟愇形愐彲恥幭惚弩恥惴戟愶弗憙徦忭憏慮弅怿廟悞慴廾彟憤忬悂幩忔彋愙怪患挍憢廚惜悲嶎愆懶忋徢彰怕廚徐憒忒廅忁异忆彬憈廾慟懸彥惦後悴損懬惏懞抪弽恆弑徎徫徂恕憌悬彻幭恂忌慡學徜忩慪惐抩延恏憔忽慍怆忹弍後憌庻弩庘徧愅庮弚愺抆忈憐徶恾弜挹引惼悵惱惵弖愑庮庶彽恹惦怡悸往愴徂懒怉悷憀忢恾挛忋憴恭怣忆彬恛怦慄怤录悮弔惈廹怸廞昹庈惼幩憑忤廋悚惝彤忂怋愳忂怵悶愰彖惴庤弻怳廬愚惥惪愭弩怷弄悔憭悶恳恀峥庣恭忎廃忲憤庑彚惞愞弣怐嶒恲恃廣慲庖念幄愊忳恱忄悗怳惰恽慈弾廵廐忕恓悼庼徘悡廑慺悦奂忭恔恊愞怓怙怙您怑恾恨怱愢庸憠愊惊愉嵖憆弙惽彫慃廄徳廪愲彛惪强怄待帛徖屦恖慲憠微廃悍捦愪微惛悂张惪恜慃弡愩律恁慖彑悥悍巕庹彙彺忻怱弌扄廸悎忯忞平愎懿怴崸帼憂惡忺徶忪怠戨恰幟憇悴怩愘岧弯恝彎悐彳怅徹愵忖恗彣彧惨廴戍庾島忔彘慼悏恎恷懾愱恿惓怑怠怷帩徏忿悫彎彉怽弩惜廠屹忬恽恎愂忀慃撟彝幨恷崡庚忩忑忥惓怡怈恖復悍忚戡愴忨怱式恝憟徔憥慒愔帳忈戮慵忾慡嶀廽徜弊悇廦情怳憑慵怣恬彁徱怑孆憃意勝懦憺怱怖恛忻忞恰当忝徱忺從從忈慚弚慾惝廔幈徔慤愹径摄怪徎怛愴式徉廒惶惛忯恮庘彀忆惾憖恮慫抋弡徢弈恁招忑弛惃彙悚惤廧恖彊態慄庲惰慍憔廞幩徛愱忒弤帤悦忉录悇愪往慉庎慹抰惹弟悀愠忳恜恇廒惂弅急恝惿彭怮幻惶懊弽弟惴怜惹愥惨廩怋役從年廨廲愣彧抛悪悹忪戡恹抉慗悼惇彫忖悌忢徎廩总忤從忾惲怛徺怿搐彍愧彋惬慃枩怄弨怒怊怍忴怫忼弾恿慊忚庉忬愩愲慷從惥弑愼悺捴忇惀怹怺怯弔愕惍怉张廃弤庻徃廹慊幰從揽愲憎恻恶拭庾幗徜嶍徏庣怂床惂廚恾攬恧惝弡悚惂弗峎慸惣徾恤埔庿彨恨忴怴怂忺怣忹微怔快弨恕愦庽庀廜廊开慝得悪害帬崱忣嶞怹弼徴怚彭怩底崲弻怑彑忺彦怞扯幩必悔惕愾愛德懨弊愕幮悙幧性径徲幽慠愹幬愴彝愵忈徹息怲怇姸搒憀徃忴怚怎怌怃怎怃怂恊廕忧彮愂愱忶恕廠弨恉役异惁娵庁惭恅愿志悪徐恲忥扏惋慢怡徑愂惊嬊悜惪彑弨惈托忮幞徯惍怎急忷怈慌恝忙廲愃弿庉弱忒掕怋彅恫憎币態慗形嶼恚怋悐峒恬庆恖捍彆愞憖弛憉強愳恅忽慿弈從弜悬待恳徚恡徰怮徾岴拞惯忞怗恴惷恽惝憾愋忢憛念帰岅廅慽忤怽彟忴慗慍懔弥崜愞弸惬愨庱恛恧彟恼所恭拝忒拟慧戝悲愔怽悈恟惚忤愞弌怫慮慀愈弆慥愷慳庋惖峯弄搴廦彡悅帛惜惺弮徛恆忛庑庖庇循悇徢寡幭悏愨怿愘形愃徾廈憿徱怊怕怃惒忤惗庺彤弣怴徃忎攏怇廆您憇悢悑恱悝愡悑憏愔愜廹崞幛摆愚廄恓惃恂庱廀弋德彟役帠序戎很嶑怫恗憔弡怙忳彊恱彻廇慳慨庂慂幘库愊弥廆屝崺彂怀惧彸忙弋弼忳悉愅息愞怦慳怗慱态憈慡弯悽愗廿廓憪幾愡徼慖彂思恿忔恂嵎愦怹憚愑悧憌愮彨忩悤愉搅帠廑悬庛恋帱得床恉惲恩幓御惶忬彷幠愙忾徵悎悬忰嵄朸幕恺恠徾恷忏恰忬惩忽帔徔忏恼慘惶弪拣惼恸彏嶀弽幦慆惆忄忏憪慴怲徣愴怂怄彊庒恊愱庇庶忾恾恡怡恾忶彝恟忪恝徎懗帪怮惄性愫恊悾弌彶庲庭慥奍悢惤幾惙巪帿庹廻徻恇廎愌弟悰役弆嵞廞彌彲悫徽恁怐悍弑异悻摺弥庂彇悰忭忰忻惧恩悹慰弬忪恛彉廎慧庯惋廨悭憅忽愈惵拲庌彇怍忠徾抍惷恲忰怔惤弙怒弐徺忤掐幡愠意怂抳徫怠帬怍彺怦徴怬徠悯悈抟怐弊恐愸并忾婖彍彫憃憴廿彳徹愩怛慴怜惗徳幩悮憟巾悆悤惱憁廁庐慜忳悤怟忞崎弐怈惙怨怯恳怞愵恈怸恬床彼惯幬憄恻復揞怦庥惧恃崹惝嵄憨帜彺徱弽恢惼從徭弲悞彈廬幽廏廻彶憐忠恱惩彖愮揇弍慀弹弻恏开怚悱愵愙恤慒憂徢憎悬崾康度惜徾怬惔悺愴恜恳怠悆忣惙恵弚怸恁徺彻恞慶庠惈惎徟弣急屼弧愙志愄恘慨忛忂忚弇恟戠息总怕庍怚情塷廜怔悷愡抩戭愅怯忝弦悻惯惷彆弰弢徆惝惻慑彗弱庀搒惢恇慭愦巑庺廩徨憉悳弚怴惊庴府念忏愂愶弥幮惴怭揀恃彡彎憽曠帖恢憂悩惵愬当慮恃彈彺帛彏愻悈忙廀恗恾彧店愎師惨廕惌從怌廳悙必恎徣悮慵帑愞徼弯怟悋恊救慨怣慂惿抁平恗忐巷彼役彆恄徵恳忰懛庋恲廣愘庞忩塹慱怔愻愽怣懃憷恎憣您彳恑忔徻愿庎廻怾彑悷怢強愍捝憉彾慞恫愠恎廄悱怞惩怱恻愢恶惠怍帮愄悴惮恏徽幺慊惌恏引愍彝悷彅嶹怾彐慛廓崃恙帑徠愥忴憗徤弆愲庖峹庻徲寤弹忨怟幸庰怲弚恰弅慒恃悐恺懬廚慟恶怬悥庚婚弨怬彸弒惦役慔徠恷徇弾恎快愑憷廍帴恐惙弦悀悇恴掊愷廨悽张恗慴扇恫忥当弓忤徦彿憼往律忙慿弃恳庀忹戁憚憉愳恑慂恶庐慢彁廰抬愤悖忡恛恀愽彸惉并息悫廦撗廲恼慓总崊弯峘忬庌廲廊恃惋彺懷慄帻慻悲徾愚彦恗恿慴徳悀憕孤抷懯彾憑常忕弧怰怂憤心嵙廞庁恙愦憝弭抵怤弬愅悚掕憄恤愐廍悛徒弳惘悖廽廯徺愭慍忩恒怑庅愁悕廆慠念弧愊彧彰庛広慴廂愯慝廢忳幊弯弢弮廆恎忬捗恗恩憯心帧怼慰惫憤徬惻徝悧廰彖惦帒惆惊庐悾恃忬捶徕憍愖帾懫庎慠徨憋彥恟彍恩当庩恚幬愂庸惮愺慸憖攈徛意憝恶嵜忊懳弭幄恾慐徹恛怹彀怾摩徿恑忺廘忈恬孵憌悐庨待捜怈庅惊循快忂弭帲彤惬慬惗弭彦愡忳引愋悧弨徢慤悒噞弲悸怍恔忣怒恻恚忪怼忈拁怴引彖怃彊性峔庢忣庖慁巍悄惈弮惊恬怩恡憸徰干惷扴慃憆愊庲弹慤嫴徭庑'''

fc1_bias_shape = (128,)
fc1_bias = '''徜懖怡忣戮忸弃悭愛徱慄幙憳恎懈廪廹悻憩愸憆或惮忢徢慲嶲忋彁憚扟忞戒戕惙怏徟広彾悽志弋惏恰懯彌彀怫彽懁或憠忥懭戎弽扄忽手恡悒戦徜惴怸戗恭庖懒戥彰扏悳忚惬忰恰愲戝忢徭戓徂徔慔廿忼廖徜急扲憪惡彦弿彞愉戼弘彶憉忋惛弒憼惔悹懋惛悘弸悻憟徴憉戴戚弥廱并戚戩戡怺彙憏忪恙'''

fc2_weight_shape = (96, 128)
fc2_weight = '''懱愝弻廛廩惄序快怵憎忯庹慢庽惡懧悔微幞恗彷惍恊嵩慿忬徒彊徏徏徢忥彮恏彜徘巌忙廝峰庣庝怫徬弦幷徭幺恅怾恮彰憌悃悈恫徥彍怌廒恷恤忽徚忬忩懏弤恾恑彰怹悺慭忥廙宮幾徽峐彰慾帪弤従徙幡康彇巀弻恼徛巶恙忩广忭忋愨彴忌废忨急幌態彤惤怓悽忱怫彡惧惾愔徃峓忮恇徯徖怌弡恼巓彙待怿怛弟忮彩庠恢恠怷徆彶怲廠怀恢彚怔徕愤惄愜惃志怱悖忨忤忖愓悻悥忛忴忔引恂恅忁徽嶽庮怕惷怐德怚忘徔恤怃惼怮怣惙德惤彵恹彐惷悼恍恔怕惴彙帘惁慁徆忦感怔悻彏弿悦応巷彑恄怱惹忟彵悾弚恍徦忮惔忾彸彥忺怓怿忻弡愣怣彠忁愁帳恘忾愥思彞愇快惃忻恾愪廣弳忌愧惐慟怬廈怦引忬忳恄怏庠廐愈幌忳怮快恮幭愆忞惈愍恅恚弶惁怹忮強怙态彃恏廂忝忠忚徴忁徝应忘庿廃恝憺弟怖悝弝徔嶇廠廌彐怜忚悆怆怬慎怰恤彑念忎彳怰庺怚弾怺惊悥徃怇彰惉愹弎徎帐帰廥悑庒庵恣忦徾怢廏嶍幕惿幠廃徣循彍幚幺徫恮庚廚恬彘徊悈慐嵨惙怼忠幜廤愚怊巻怕怵悭式弣彿恞恪怡弑帀怃怰嵐惛恣悔忭怜彴帊忍怬恈想廻恾幚惁愢徽徏恤悗悼悪惠忢彻忻恻廴復彿惞彆忩恈廱幗忹徯忺彀彫廙怹得急弁彋徻忨悶惠惭恊怌悔弦徜幆忇怇惖您徊悤怯惚怷廂忐忸庺徳惡幣恧廚廯忦恷崗怲恓彡憏彾彄必幦彶彧忳御怞庠心徱怫悋廳彯恖快忮廉惝巠怫忝徤徧廻惐悲怲悀怄悮彛庸彘惄恪怔役徲恫徬弇扅恾忬嶿怛怡怽恘恪彅愮廎怲彍彯悯怨悌恀恆悟怕悘崽庵恻恵惻扊惒怦悝恳思怢径恗従崟彨常崴徊怂愔憉恨悈循弔怭忹怘恮徟忠忝峺思怏徏彧忪惱愵徜心搒徨惈悽恁徫悒悋康彫悄徺怢帄恿尾懦悋弾恴惿彶廬怰恌怏幁恱恁悺惊弘徲彚愎彠幨悿慹御彰恄憚忂惌彭幙忮恈愐徘廪悛彵彃恃征崋恬彩悳怼憣恖悠徧弥憖心役恖微怩慅忭恻忍悅恏弸恝忲徶徸彵忆徬忏庀庹悙惯憏彴悟庳径庅懃幰怯悚录愎惐弱懖恁懄徣恘悍徟恺彸彧懝徢悱怔幏怷恪愣恸慑悒怗懩恜恞徰徿惠搕慉巺実忝恑拙憳忖惋惗恈後幛憸徻惂巹怸恞挋惈彌徛恥愩彖恉慱忁徤怾峔愿忰恃怴徸惜忻彜廅怗忝愵怉怵怫总念惽廐忑孔彗徹悀志彄恄忆庠恫惑悑悐怅恾弌悹怎怂怦惑愶恰慣恝廴怀愡恔怮怌怉愁怀忊悠廚彗待怔徎徂廎廗恙悀怣廒悥弯忤惼惓悢徘悿惴忾恋廸恟徣慍愻怩怦怜恭徤巃慞惸恍忺忽庥悑怓怼恿悆应廾愋怸惕急徚惠床忺彦怴悔悤彘恇忚悈怨恌弇惂徔徇忯愱徔愽患慓怴怨恲惋彠总憁悠忭店忢怴恧憂怃徊怙彸弈徲惎律忷怜怓徒愞惄悔怤忚怼彌怳廔弿怃怕愒愈愖惰弩彐心惖思忆慈怼悠恅忤弨彛怯忶廭德录引恠悼慯彥悲恋恜忙惫恈彔悯惋忍恂忊徽怫愡恊忭恨怶惬忒嵏悇忢怎怶怼廖恵弮忱恦惟弆徿惟彵愱悱怢怬廾徊怇忊惹怳廘廎徣恥忖徂形悧悁悋廴惋帴悊恶悴愎悃愜恧徜彪怽慙怪廅恥愕恖愨悁弋悷忷庑彤愝惎御悇悂德慉悩怇惬忙惘彡恪後恞忷悯怪怹愰怴彞恂急怲弧得惐怱恨恦恒徢徶忚怐忂廑徘徨悜感慘彤忣彡恘忶怤忠恙悔恙彵愓弶忍怙惨怿弻忎恐恞悛帄慃愷悮惋悑弗怣弣復恟愃嶽忪愈彣惠惹弞徭幽廧忏愤悘恮徘忖怃忓慅怼彵忨忏忴彽愒彲恰愩惍悹怊慂悧忠怵悥慅彺忈忤惷悉惣愕弨惢恡彇怢彂悕弶悼慭惢惇形庸愿庬巬悏怶廾忿惶悀忽怽忺徾恢忾恡弍愦彀往廟弢惊忦恛忕徯憚悌愮愑惶忿彌怅恳怨恽庬怴忎恾帟彀忐念彇忶忱慶忡恙徒徟悩忼徏悺弸怑慣恗序恭彥忩或惔徽拷恸悁恕張怄徧恃憛弭怑愐恾彘恛彌徇悔弻恮惒悓慙恭惵态戨彛悡彳悧忚怉悾怠怌怩徆怴惿弟廩怇恟後恮忰懦怘怣恲悚床怡悃嵖怘惃廩恳懖慌底恇徳忌恕恪恖忧悽徽忾弃徕怗忌徙恬恖廣愀急崈廆惬弚度幷幧归悞怂悱嵣惝廱弉惰惞恃庪恛您弬德张惋恓忁愞怋強彺慀彶愨徾忆廘忻忨嶬律彝忂彤悙廬已恡彊忀惨庭帕嶷志怰彰怏弖弖建帤弳怫庲嶟悄彰恎彚恥峏弓怂恚弓帺怋恾工怿徣恮希嵄彂忋怭悇恞幽惱悐庾徤惼徸怑忑廐恲忴忥怏忑悘彭感徵当恇徸怙怂怶恰悛忠惭悰往彜忞悋悫怴怿惔悆廯悱感悕帻幺悪悇惕弚廨悛弻开忛很怀張忖怗庫徵快心徼怲怺怳怺忛悤愰幛悐復役怐廓専强惬愨恵彉幑憭惴录怈恅常廳庐彔恴悦徤恩康弢弝思悮愢怙徶忤悄從忽廣恐怲往忿庢徭忩從惘怃徯恻径幈悞怤彯恵惦忕忆悔扮強崹憐愡徖怙忪彵廦忙忋惞慻忯懻弅巾廘弴忁徻徛愈恳弮恧帥惴悲恜徴恣情怽怳弁悯愮挤懞恬廼徊幺怹懂慊恅愩弋惣怍徃悇忉徫慪幏廻懛忥彮崉忣怵廩愶怉帩怜情愢恤悦惺忝廸怣弈忚嶆慦懒廵憔徣恍拧惒忇怪廒廜愸幻悊庯愗巧态恏张嶓悪愙恣慮彶忛庥征恀悽怮帧徴悍忧幯愑悎惯懦愀庯彻恽忒愍愨惬弚惌悜弥忪忊恷廯懎悯復怪愴忨庫忶恸彄怪徤徺彺忮幰忸忸急慱徐懇忐彖彀悱悔帞憮庭愳意恜懕恁慟廮徉怖愙惈恍悰懢弢怊恈弬忕彘恍怤悂恷応序怪忾庘惪憏挂恕徤怭怉恣撘恇惎恷怤店彉徠愝悻怫巇彎廻掼怡徹忇怛憅徑异忖徴悎彬忚惝微彟恎帑愻徹慝彿徽忪怒惖戟悛怼彾慂彾忰崱惷悓弛悃彂恺徠忚心怞彙惱徃徝急怍恭徍恆惉徚怔志恗怓廚忎悥愜恹态廵弔恏弦惤恔懆廼巄悇弘弪很廓惢崜悉悁庎庶忻快彦彛彵彫愨彁患悀弝怬彻息弦忻慵抡役悞恦怪彍廗庾悸慹彆怀怇弝徃庁怶愍惸憇嶗忾怔悫恡徐廠忸悌悜悰廮悐微惆律忘悦拯廧怪恀当張彿怊幌悮忴彼并忣徾徛彪恑幾恽彀慽悧恷忮怮得怙愉廂怌惏惃怈怐愘廛恸徟忟彶律悁恲惩悜徤忾恉悏彣怯恁惔忹忶惼復忟怹彠德忩庝後惷愖恄廩恑徻応悼惚恲惇悊慆思惿徺往悕怺愩忟怎悄您恭帒惤悶徐忯愠弡愧怔忪忬徹廫怙愣志悯恀异恖庄彐彌悋惎忠徸怨徦愃忽悕彌悬怳徃怤忎幺怨恲惱徵徉慇怪徢怵慪悫応恎惸愄愑悓患後怺忠弋惔忆忓徚弁戦戱恛惚彾怦愓憓彅徴悊忬徻怒怛帱怕彧怈怆式徸惺彐悑廈惖怨怠廂惽復幇帉怤愗徘悏徨忁慺弞慱惍彮忦怩愇愄彜抢恄怺怿惱忱悬悻悗悲彶悘忸惴徜幺彉懂恨悳快弓忼恒徼宵帮思悩役惱忡扸怴徲彆彋恻徶憸惵役忉忷廋忩懆怋庖惂廵愮弼悙悵忏怘忍帽廉悒恆报府悋惙弛怐怇幻恸怟恧徥律怄忣徉恿必彌徛悖忑怋彲忩性心彨恝怕怳彍怔径恃悮恮恟悬怾徙怖怀彌怓彳怏悒徸恃徏怜忝怪彋恃微忥怀彷徴恂念志恇恄徛思必忶彟彥悓恡怐徂徶恎怍怊忛彫彺彔徂悞忒彍徵彘忠恳怓恉恆恚彙徙悆志彪恪恻影徒彌彫恬徐忰怇彲悴得怮恿怔怿徔彩悫徖忯徝恧悓徸徇忖忚怜怘忆彳彫悔忸彮徘愄悖弼弉弖幈惎彩慺悇建怜弡廿待愔忯復弲悦彘忱忊悳惣怎恋惧慢忨悃恠必悏憈愘慊愀惽彮幰惯彩悀忒怆忷惍悟愾恔彧愹惊徹恊心恟忺徔忬忐徉恁怡忭怗掅恚怗慄徎必悀悶恘幮怦惜廝悃恘悭廢怙惡悙愵态怗弓役愳弳慫悈怟惋徙慰恆悝恄怚怎性怰循愜怳憏彷恟弼悢怇悟恒慳廎惙彽廡彋怟悛延愀悖悒徱忮怗応恗恂彟忴恜忢怅恣悍彘彯恔怸彌恳彮彟彆徦怂忠忰忖弯徻怰急忩彡忾忊彫彣忝徵忓忧恺悋悏患恄患怖征恂悜弾徹怩恦忊弸彬恬恭怵恕彴恭恦怛徉怳徠彡彔忍弹徂怱彫彀悀悓忺恡忻彻恉忨怅忆彯彸忊彶彼忶怭恂怔怈怣彉後徲忯彥徯彵彲忤忰忀恩忷忧徘彁徳怤恓忮怅忛怴彤彻彸怙彭帢惩慌忑愰愖庵惾悰彉慑忓慉彮慊庣恍悟悋悤慏惨惴弴弯恇惀彰忂怪徽忸愳悼忺庾彎怕怫廚忲弱慈恸悎怛弃忨怓徵慖恲怕怕惋弉怡忌恆恴恝悎徼意恑悉形崍恇患怬悟恥怤惶恫悪忴惆录弔恝徯恩恐彺悬庐开怟怖怽惲怯徎怐惔恳忄彷悮怳悉归恒庯忮惜愆恇彣惖愮徖彾悆愂忮弗怲怵憁愈惽廒恗忁庴慘惺惒怺怭彖恺恬徣彙徜悶弁愥归惋悵忴幌快徆恫彧徐恭忙彏彔忓悬弊怑恓彧廭惽弽惴弐戴惋怩忁弤恅恏弑怖怇徫惒彰总彺惞忼徠感恊忶徱恼愎惚徻惏戜弴弼恔慶悚忴幁徯悋幱悍廲彍忀愾忴徲弶愪応悛怢愆惯急弻弮循怘怑忆慞忊彛恑忆惕忏從怮忓悩慤恛恣怬廈找恎您愊愱张幍徜悉悵徤怺嶌愑忧惥惂廠惍彾巿怖怞心従彇惃徙悢忄延惰怸悞悈慚忛廮怅惖惠忱徑愣惵怦惧怣怗弣彖弳彺廸廮彼悂恍悆徨念徰徕恘怼怵徭惋悊庛愆床悳恣愑悓彂惶愄悇徴崴愵愴忏恕恬彻恶徃忝快惽希廴愕志慳恨恬彙廤怋彄悺慀怶德徯彪悒愚忐徘惐忄彯庳怱彛愒恂惄恶徜恄怛怙怚怳愬弻庫忲您恨怮忓并怛彬彇悄恢悄忻恀怛恑怩忞恦徊形彐循怛徫忺彺恝录徧忞恎怀忉恝悒恧怾律您恷恩恜彴忰怗悒恞役形忑恭徣微忤忴彚忈恧悑彿忢怞怪悜怼怿彌彶彡彤悇恷忦彔怟忝恥恵恉忉忾忻恲怙恁忤彇怀恙彲忿忉怡恄恙思徟怩徊归怷怠忱彦彻忼彼怎怡恠徍従彨恒徕悊忂恦当彠恇当恝彌忄忶悡恒弯恪徘徊彨忸彬怉忱惗憧悓愔憤悙悎庣彑慡弥恞憖徵庴彧愊怢徖愇忪悴幙徘忊忠思嶃彨彀恷徳怴廵床彶恂彌建扴帪惝惓悟捉徦愡庩弭徍忕弳弐從批弰引悋徛微往怐惽悮怌廴巳庳彦弡悔悸撳徊幆戴悔徺旰惁恫徃怏恫弚憾愈彪悻恍怐忡撱弳很忌怃恆恏循忻恀惶廾惜忋怦徒憦廬怤弫徯弨徂怟悆惵愲徤恥恘怂悴怎怢恖彭忭得悰彮忙恋恎彗怚彙怬悐忹恛彵忟怈徺微忦影後忕恩悔必徧彰律彘恃影忖怇怆徻忤徃恉悕忇悜悥彽录怒恺彪徱彧彎忢徜忬彪徚忋怎彇忋復忮恐悞忯怹怢悍径彧恩忘怷德恣忈怋恀忆忾彳徵悐彼徰徢忕恨忆悫徛恺恛徫循怦恦总忷徏忸徻忄恶徨忆彈恡往徛必彝往彸応怖思怇悵復徳怦怴彡恎怖恡惂忙恦弿彪憰徐弟患悙惄彻怗忯忩惑恅怅恿彧怊恗循恲惞怚恌慙憂徔恟忒忭庪憸悿憾忎幔怮彻帾忩徙悙廁悇尉惈怑怽廭忞恞廤彄悀巙恋愡巩忎悫惊徜怳慌揺徭悮式廭录廛廊怪怽怄忡懬怄悳循形怶悺惪彽廞徿惴忰急恞惈惔悃恲徲愱怃徙彃惿悓憉徂庮徶庌悗怯怤庛憈怎徺巽悢惌弉廩弖床忒惍怮慠心庼悱忓愑徠强廏徘府悓恷彠弤怽帉強怕憨恼怷怊悢恺巋忦徲恾懸彐徲彏愥徻帬幾怑彄悞录愕恢怢徣惓庢怓惪廝录怎愁嶻形怯庱惗徚恋惽怅恺待怰德惭常彣彐忄忊惗怦嶂彲悭懟慧恆慠峺幬惻惱悸嵒愅怒恷心惀惃思恭役忌惽徳彖彩怺忢愕崞後徃弹愯徧庒忛彏応忕徇彃彭帼怉情得恠忨恆怒廡承弞恠徹廽悉怕彄廤彾彿怷怪忖徙慇徧往懏弫息忠彨忒恟択恉弋悸幯忲忐慱懕恜愐慌悆弈彰懾慹懛恍彽悁彝彧悉慄恝悯廿弗恙怿念恬弳怏彘恧慞惃悏巬惧惗得惚惏张惄恠怟弥恲憕愗惙怺彃慓弰慹慺忩愦帗慑悹憬彫忧忻惺惸庱徑怊循弘恼怫怪庢怐幋恭悸悄弎彛征惆怸建帾彍愓挍徧恜悁彾惴怬忽悷弣怎怽愜庅慌悏峏恝忆庀惯忀恕徒惒惹彀悯悁恽惄恜忊庥幢怦忷徖恞息恸悭悏循带帠弊废怍彸必巟応忘怺彳恱徽帼怪怶忡廯悺急庣悮幐愍归怈慇悸恿恘惢弪忤怷惚弃忉很帔悋幗忳惢悧徯幷惆廰慖惒嶁庛庆徶徰必悴徏忼徸弚忔徒廪帹您恁怲庘患幗恤惆彪悱廚恟悹弹廙惢恦弭彇悘恦惄慂忊帗恉惃幀律忧悕忿徖怟急忶恐态恍恐恌彰悵彶徐忯悚彚忭怰彲徽恼怗怑怭復性徠恲怞怛怓怊悫心忌恎悊彨忓徊彿怴忩忚徰復快彮徦忝忸悀怺徧徖忁忄彦恋彭恉怳怯恑急怚忄彐徿恳怨徹彸徴念怃悄彜恇忠忑彚怼悓征态彦怆彘恥忁怖彟影彍急恄怤忨怀徟很彧彍徭徚怮彏徎恑悇彲彛怔念徖悍忖彾悯忛忈恗彩帞忥徤恋悆帘徑忺悘彆徠廭廅悗怣思恚悸意悱弴恒恇懆憪恴徝弶帿弧怽悑彿忞惞律惐恽愚悑必惽悝弃弈廐愦恠悇怨弭彡忌從忢归恀忉慮怐忦恋彟怉忪悍恹怊徱心戳張徼忯恚惞忰怎恖拫彑弩感忖愁彧忯恟愨恴悖忮惖微怉惓态惈忞惫意怺悹徠惤慚徲恉悶徿恥彘怕悥惋弐彛愋徂庘愃忻弿廤恅恟怯愡忨惍忒归愥恑弨怱怦恓悭弱怋怚悀弛彘恿愰悩惮徳忩廝弉悕忶怏忁徇惢得徸怔廓幹恍恂弚彲忘廽怺恰怷彺怒恣怃想恬忣庘悉惒忐怆庸慊徦悗慉弝您怬悃忻广徿悎復愞怣廎悥忱恣恛惔怲廓您弘惤恀康怸帷怢怪怉彪惓恘急彛忞徤底幻恣悂徫廩恏廎怘悿恮恉弔忴惡忟忇恁悠彯廼恁惸怬愪恱帻惋悢微彗形怓忍憭懊悕恖帓庲愉廽幗幣怾怠律恍懒彥態忖慄忿弙忙悢忨恙忔悏徼悹恆怂庹幔愕忆恨忰怇弃怮恛徥彛応廦恼恞恭崃徠徦币徎怉忮戠悧徙惚怑悧愖彚廑廲弛徊悖廖巼庿性揠慀弑扄弼怽庚惞惃庰徥弗彧彺慑悙彙惮彾彜恱徎徯廖徥徦惕弔怸懴庨想幤悮幑弛怫廮怕恦忼彬怌彾弿惊怬憨悤帶挄恰心慀悲影惿情弻憀愃心愤彠惊律急廇強恺惠惀怠忞愞廥忖惝彞怟得惕恚悢怈恍弖弉廽徛廄彃市幹怤恳您弖怓彆彫忟慡怬恣怋忿弘愍忊忟悏慁恹忤悈悥憟応岶愯愘彾惯悠廲惟怣徟愠忚强影怵恅惄徺怚彛徦廰彼惯惪惄恠忙怖愐恂彯彤怟忣径悙愀幽怙悉忧悡廼惍恿彫怓愶惨廕弞徕恋惸憍忯庬忭忧彿建慂徬彠惁悃彗惌恽愖怀弹憔弶惙恸徔惿徲恲惉悂怤态徚怣忽怚彨愲慝怮恖怰式徠忕徧彏徣弹弧急応怫弢情怦愆悱愐悸徂意忽彑憏彣怒怟忈慠弬恑怖恸恎庢愔慂徝怎感張悳彭徑恳悄幷弇愡徟感惉彙悞彀忯彲惓惟恬恥怜徉惣慜怌弃惢忕惣弥惻廟愳悮悁惱忨惫惹怽恙愘感怊廹怭愫悤惼悎徭忠徊庫廈恤愫忎惂惜廎忁悗悫怈弌愭怎恗徯恙惷恅惶慘悌徿弥弬忺恎恖幢恗怾徾忘悼弓忂恮怪忔彪怯忛慀念怪彈悓怄忽悑悹惪思恰惢徐息徾悚忖怨惑弬悸忔愣忈嵈怪恆復悚惙悂恅怏惒惣怬恘徶恑恝悳恉徸悢廞惜怆怢恩忆愑徔怊愲恏志弰恎忑忽彑愪幥悛恦恝恸徘您愘惍往恃悤徫怐怆恍態忦彈恜悱徸彜弶惑徽弅怸怹底惾怨悻惄徨恢庥慍必忬怦徝愅愐惭惚廯怉悜怸怸彄慫怡忆悂悘忴彸後忑弅弅張庚怕惷恽弦悌彌惹情想悚怇愩怢庠慉怦惘忱惵悢徦愅惀愁彶嶷慘恢彯愮惴廣惚庵彀忉忶嶱忟愻廇憴恖忇怔庹忚忋怤感恻幰復怞怆悿怚彠愃悊御恋恍廾愛惓愉愴徤惙怑您弤憮急弿忖惿忼愊惛忳店悺徼彞応怩快憘悟廉心嶨忖忾得惩态態忙悲征忍悘廇悃往思愢当恨怺怋徥恒憋恪惴慤怮悺怬恰恳慺忢惣弳悴怊帎廬愝巖态廸恔悭延怸幝恇怦彗忘忆怘怱廟忩徂慡忢廛彜悯怀徔弫悺懇恀悌恸庮慀廗懺張忔帷庤愓怈弭徑廲悩彡徬彂惰廇忴彎彛恄惲微彟弪忶惝弉巀怴忔忷慤悾弩彷怸懀愎怇愞弃巆恀弹惃恏怓忡径恖徼怲彤忀径怪悀怸悜弹恢怞忘忱恐悌彏恸忷怀恱怹忦恤悒徆怛徤彅徿従忛忾怂忖恍恠怟忳彅悔悙恾徻怙恸忋從彲忿德彰恠怰恣怿彁彾忕悛忎彯徝形怕征徝怊怰從忤彎忴彺怮恖怅忈怈恂忈恉恕怆忬徥彼恈彋怚忓彗徆悒徲悚恇恧彉彭怙徊微恹忝影恶恑怦怦彵彊彶彈悱恡忻彝徖彋彊彎忦忧恆忕徾忾彶怄恝彗径怱徂徂恊您归忽忠忸彗従恵忚悞怟忡怛悆徇徧忣怡恌当徳恆恾怺忂待恳怭徶恎怊徤彥总悁怡悤怮得恦忽忱恵彉彙恑忟彪忶忱彘恟彑恁忳彚彽怂悘恂徏忡忎御怉徂怀徳恝彗恨徢怖恱忦总徔従彚応怮恩彩恆悍彏忺恻彑悥忲态忬彲彿悝恌怀徲恲徒怒從彙得悖必恤徉怯徫忳恆彌忴悮惐幤慛忝徑彀幬恧愫彌弼惎怊忦愜恔弫彺忊彳忂彂愕憂忽忁徫愸徾憱復悱悆慠惓惹惙憏惟彮恓快归悀巃把彣忯悳彼忔愾怠怴弧怍慈怭忮廭忛恥征彛恣悯揆徱忱怾恡怲悲怾徼廹弘恢弱怩志懌廈怂忧徼弃怿忍恼忯怏彅怢悆息恦忋惱忩廈忟怅怟慄悊彏惋希愉徠忖惲恾忆怍彨巘廗惓怳忩嶃忴悁廇抖忥怫恙忞怵惄庽恥惴忼惨廹惿忨恤怏惃恺徻悎悗您悥彔恋悈悮循徍愂惣悕意恄廔恃廩怫廞弒幒彪慀悭怤弽恢徐恊悥悥惹徚忦愙徆悢怫恳恌慃惘忎愠惭惫彜嶯惣愙弞悔恰悇急役径悇惘彀彑恪循悢惚恌徉帓弸怩怛惯忊恀弅恲忳患恝弩惟悅悂征怆度愖想怠怠従悊悛忹彚愇愄廌忨悊念慦慜悢庳悱徛怐忷恤惹恕怎惁开恈忼惏恧德惨彵愲徆弼恨恼悸怾惧惪弩形意恰怑徉悪愧悶怿惄弮彈怆弸忥廽庛廜慗怍愧弲弢徣忋恫慤怉彤悱恕弓悍性愾悒慀感彌悧忢慉弰嶼恂恬怴憁悂彉惴弖徟惾惓応忀惫弋慌怘当徏庡弳徭怏忦怞忽忍張恂悸怞弡恙征悱恘悥庿怒忞惦惖得息怂徚彿惰悭彅弻忝息悹慓怐彁心悖廯忧恟惊忹愌怍廙愎心徥惇忴悛怳愙怓怟悭忈恏恓愊惈彰徨徼恩忊従情愭恒恟怩忦弨廸徫徼怇彸庑惾恦悁弜彫弳恅愎惸惘悺悋怜廖惢弘悮徧怚愈弁惞徛慊怾崸悓惈徻慊恡弶惏彟彑徯慍帢弼悳怔悬忢弟很庄忤徻忽悝志恸彇总怡忛忽廕忲彼忍弩愒帝愪悵愚悎彍怟愼怸弻愶慙弤廓徬惻惒慛恁彦忦弮弞弫恢怇彌怒性彲悥徘忘惘忭恲弫愿徔忹恍愨恭怫恊惄廐弆恩徰忎廖恧悩忝忐惂怔忽彪恓彙復弣忑怇惲愳忋弇悀忧忁悁悶弢惎惃弨悤廏情悔悓愄怳惍恓怶怺嶌愍恘悱感惚患惺悆悆愚惾恞志恠恑患恼徏怲很径怦恌忈怗慸廛彻愲愘徠彬忘恨怌徉惪幄悞愿悪愇怚愭忥忷忺惨意忆徉惭恒愄悯悍徾悞悪庹息待恻必怯忋怫忒従恅怌徧徏归恨彾徴忁怇彭彩徙御恚悕怄忳恧忛忴忱忭彉彩悛恌悚怸怶徹忙恪彶恖恥怲征患忙悎悛悥恂彽徎怳彟怹悑彄忒徰悕忭復忟归彵忨忹悪忇急忶怢徻徟志恒徏彚归彯彛忥悌怕怿彫徙怑彸悒怐彎悔怺彫恞徚总忐忓忴徲悀悑循彛怪從徺恱忺恐徏循彪恌徙彶忐恠彐得彸徆悌弇悇弹怌忑廷懰忊忪徝忔悚徯慬忻庑廻強忶恜忆怘悇怦惋弐怒徢庣惧悠恪恐怞徿廵念惦悽愧憄慈忟忉彅恠徻怨徜忪忲愙忲恙恝廽忧憚彙忞悜徖怖忈徴微廔尲恔廖懊怊慩愛惎惁忠弴怄忌恀徦徫忤恄惕忎惡恿惇怡忡忱彃忺從态徎戵忹忔愀忘愠怨手愘惱彧忁忄惹彋惋弃弖彧惘嶲忶惖悧悆惙懮弎徰慑悻恫忉巛彆彮式庎彙悍庱忨悱彇微悫拀廤彡恔徿御律异惃怸录怾慪徕帬徸彽忔怳慄悅忭应廀恅巹強年悮徐庎彦悖彭徼怋恵忓愌幯悉悓愰恡庇悬惃恰幧彚悄掹忄悥惑悮御忒彘怲悻廗征彘廈怡彉张往惿愀巊徰彃彌悈布怃怰怰徻恉恬悚後想彶弈恹惂惏怴怺幡彽怄忍怇恹彿弫悉府忏忙廽怸巎弞彫強惜彧恞怭廋恥怴嵸御徕悅愎徔恅弒怆庌忴恃惜恨惄悜恀庸巳惁思惇悠廆悫怿惣悌庀嵶忉幑廳巗庄廇悵恛愥幇徹弶忏怮悆悲彠忈待彨惒嶾怾志态悩忦惰惃悎恪廒循忟忀徾恏庆忓徹恑性愎恗帙恡庂応忘嶫徜帧庸忡悩忻惐怶廝彰惟悅嵳廣恫彸忊彾忠嵎怱怬忿徣彫怢恀徊徇忘忬开怟慓悪徹忂底引恥悅应怃怤怾您恱戟我徆巽廔恿幒悌惣怞感役忎悃忩恳忖恃忐张恠弬彾崪弔弞忰惐怔恦嵍悓悸愕恅慦恂悿恂恂廍恠惭崯径恝怘惡彏恈彸恠恒愡惠廒徥怆恞彋恓悌巋廲忲惪恹徟怲得怳戃怬怯憦恘徊心彯忙庣幑彀徭怗悳循彋悎弮廜恙廾彛徉怨悖愅愊恞慰弃悄廰彮彊忓徖恓徳徱引悝恽惓微忥怸庥忑怘憕慊影往恐彻怴徒思弿怲従徯徨彥怸彶怨徻徧恼徰忡弾彡徧彑彠忱徶悡徃恱彶彑忛徢恎徘悬徇恌徙徯怑徺忴彙怀悈彵徔從恨彺徫悀忯怟徆弹忩忄忱忯弽怰強恆悛怈彭恵怾怄悆徺張彽恋恲忥徂彣忿復怍彠弸悧忹怜怮徼恕待忷彔恩彄忩恱怸彛怍悜恁恾忕忖恣彥恌徊忄恓彮彇彂徟恣恏径怢弭忔後怑忌忮徛怒恵悩惑愭悡彰忯悵慄惔恗慗忣恪悑怚恓彬忌异忳憅愾怘彪惗悫忞徔左恓恜慭慜惯徱愒愿愀憱忠庬復庽恸帬恉悝怦恡悜徘悁彻怾愪悀悰弇恤悙急彁彬愎拴忹彬応忳弹惒廘愬愨弟怟扜慔必愩弓当徍德帼恐愋忹忱張悡幹愍忺怪恑惭悌待怴懲怓懫度怋廤徠怪弞恖恶情延恁彌惍庺悈悦悟廰慽恪恨愭恶悁怚您愅弚恮徊怷怂愉怣悭拉恭总愑徇忠悆御徂弨惵慏忮弮怩懟彀恓德怃恔彚惒慲怍捙廹懀悟恔弯总忍悐恮慥悑彦悬惧徫悻怔徽惽惋怢弸忕怑彻式悴悡揽彨忸弨必悏惧徱愺忄怌惩怳弒廘所忼廔总怓忉廜惼恰态徥廩想憽得忭序性恳徛惠愖悕戍忦很思府忪怦徰戡愑徇彟彟庵怭忘忻微幋悧息弚怬忊怴忩徶徏徝徴悊徍恌恁恂德怕徣従徒怕恙怸彗忧怟怌恂影悈彏怭怅怅恢役恔怍恪忬彎怏悉徕怣怏徝往忽怚徧恴徖忒徠忁恵徶彑忬悝忑怞恐徲悪彟徹弿志彟悂悕彻恋徚悗恈怂恘悢征怜忚怒恿怈恪怗忨彝怤忽怈忴徿怣忲徜彩徸忽忽恿徊悩忴忺怎弸彛徠忹怅恪忒彵忧徭怡恠怂恦徆彽恤従律总恭怩恥悽恒惧忊忤想怖怄悸怤怯性惾恮恈恾徰怴役徉恞廤愂怯忯忁忏悱彻怤愄彳性忨恲憝忸戁怑慒悎忧徚弴愞愼愞悞怍廯徱恱悊悴懜怸投悡怐忐恨怱恢怆恚徊懁悇悓意徿惂怽怮惠彊录悊悾悗彑惰怯後悈応惙悅徏廘彎怰憿悢愍忾忁悜怢恹憊彾怟恛愿恑徵惵徛悮恇惡惃徇弞引憥忕徨忞忮志彫惯恳弰慖忎巀慎弸彪恪恱悮彪彵悐怏幻愙怙彎往感彠悳恡怟忕廼怙愺恶愈廏悍弄怹弻徹悆忤忕恤弬憮慷彧悤录惯憥徧抚徠待怠忠忖徊廝恟彶思彮惖怦弞徭惲恦彳彈彈怷恪悫弻待懢忒悜怄怤弶抡悪忧忱悲悛忧慻戺惐弁恭悮悺愣恢慳愜快愷憥怕慶徾從怋戋忔愕惷恿慺忾忐慐忍彮廔忼憇憼幯弬惑悙悋怇惺惃弙悂恴怙慒恝弾惜徬必快廮愖彾志廂律恴悬惷惌惗恿忺很悵恁徾底悠恏恤忷愅彤归忎恗忋怂弪彝惸惰恿怕徙徍恌忿惵惪怈思怿彣怤從恾怼想惋忴怉惌愣忴岔怲悃彯恨怳彩怮恵怋怾愅忈徔怤彷惚忀怙弴徛弻恔必悞态急徊廮悒悬忞忏恺怒悮恘忏幖悜惝恬愮忛怖恩惁忱愌怔弮忶忌惷怳惉悽徸彷悩復彥恸忎彯忻恐帄恖忌彝忛手慘巠悉悘弾彪恠惋悬忂悂帚徼恎彏廒彃恡怢忘您忧巅幭恥庞廆帅废彴悀彩悹廗惱帱强愍忸怳徠惙惍廔惝徂悯征徖愞徬徖怞怲怆庫徟怪庭惌徳幛悆庝弔徤忨嶙廅惿弣怔徛帹式崿巕恻恨恌态弢座幟悍悻徒弭恝徥怯徖惍巀悚徙彂心庋惣惌彇徱惷恛帟幱徧忠悌愆悿强忖怿幛怕悖忦庞徨徭庭弦恀悃径徙惖廯惴悹怐怋廒怛张悱忓庠徴彾忄廿怒惴愀忎恿彆幙忁怊嵬庩忢归彣悛彤怢帘忕廒径忼悆忓彰怤惓徇惈崃忥廃惗忼弍悉弲徹忧嵡悪惈币恄愀徂惐弫巁徤恖嶀嵠恑徶悦悄悏干帠彚弚彭忉恼幄弚徱恒悳庤彖徘弙廴弟悖嵣悑恉愛归怖怭志彙恆惹忢徎庪廌悧思怦徢彗忶庄庤心怪彡弾彐彻往徙忊恥忌忌恢忮忨悏忮忦悇彊彇德忽悄悓徊忰怙怺徎悎恘怤征忹忼恝彩悗徶怭怺恨忖彃忥恲彄忚怀怉怉念忴恈忶徤怚徻忉忚恠彲恷怵怖怞彈彍彵彇彲怲悐恇恪忘彰当彅彞彅忌恊彉忨彧彋徦悉忬彝悕忦忛忂彠徆彟徲彎恆徭恭恥怡恜恠徂彖徐恙徇彛忝怴怌彫恙怳徖忮徴弳彜彟忩恻強愱怓忤惂忱徴患忬悉怊怣惊开愔廡怕恨怆愫恐恫忱彳弧愃徱恹徑惑恜怅恒怽彶弓往悃忬怋徐弼惁愜怅廦恬弹惉忴惓恡形愧愀彼慍徯忿悥怦悇忤忣恹恻忒屣悧怴徸恏怉彅悞怂徲恲恭忍徐怇徑恳悉徚惣怕怈徶愾愒念弡彊徎恨怋忙怄惂悟怐忰恼庫悡愍悺怞怸恔愞影忳怿慣弤徬忘怺愌惟徸徫愆悙弘悖愖恫怗恦忚忺恐悄怜忧弱慀悦惲悋怽怆悘惆忧徲怈忬廻悪忻庺悀忞憏怐忷慕廌廗彬徑悠彔忐彋惷忢徼彬恿悋廜恞恭怌怷惁惠形惪恶悅忒愊恉怚忁悉惽惛彃愁恔忸愬恼彝恵忞彍恭愤市徟愾悽恺徭廃廫庵怡惇恵念忥彤弩彭忋恠弋径恂彍悽怇愓巙恹悧怂怗征怲恈悁怣悴怏怗弰恱悸惨怺恓彘恘庡庽忓憊悺愈庐帛怑应忁恶怚彦戱悯忢怛惮怔幩応惛忩弦忟愻弬忈帼忝恬怽態悕恤徟惈從弃徤廗忇式恝悆德庵恛彔忊悷徎彎愓徕愎愯応忘怗平徳德憣恟悙恒怾愌愤悵幘怫懕挒恎恪寜形愅捤戉愞徢怱廖徂巴怦悉悁嶡忑恭据怇徹忌怭忺悱彝忁恮恓急庯悫徥悇怸徲恚恅怺怭怶忀惎弯悰悫快引庻怍惂宜愪徚忇怖忈惝彬徒愆患怕恿延怤康愃怽念恉悳愣忋念怅庽徐悢忲忿影悏悫怱惩惟忌忻忏怶彳彂幓庉惍忧惍德忙張徏恕愦徿恦悊惱幢恠忹悳悠恗恴忼悞忪慇怴嶎恾悊徒悳忐廤怞怙彣悛忛嵣弩怘彣愽循忦怰幚庚廍恠愶悏幻恀徼徺悼怤廏恛彿恴廽悑弻忈悺患惍徒忌惿徳從恢性彖庀彟恗恄惩悙庇徧怵徑廷怕徾徴忴徵庳愤怿忞怨廒恀弓怩彄恓忈恡悔忭惶恥忆怪惠恍徳役悰惸彯恡恼徿微徿忎恌床恢径恴悐愭弐悗彈恚惆惴徫怱愯惱弐忺徳恦怍怽惤彙徲忪惧廱崮愹惘忏怛忑弩怌忋恎惞恶弞強愃怀悈忎徠忛廤弈悜悸忦惭怶忨彸愉愿怏弲惙恐恥応悆彊悗悞惻怠弿恾惍悃悒悕悬态廰恂息悞惼恓彮忚恾忒慫徕忦慁怗忌恉彇怴愍忝彤憀悅怚忕扴彲徵怮恑怸彸彾恝徙徖忕択忋憚彥忯恬愗惧恳怰忩惾恄忆循弈慄巋愧徍悴忾忯怃忽弶忧崎恎扄怜忦廥忠愱忬廎惲怮揆恔惍惮悏忌弽忉彊弪徊悐徱彵惦懶忝当徆慊弾患忸恮恢怫左憙怡忄御廲愞悡徥廷悥循愢恵恳忞幗悥忒忙張愓忘恺庋嶞延怣彆恷巾悹恨徲戹彑悂憨愯惓慿护忝忚庝惲悡恞徾怶徢怹怍怅彏恸弶待巋帒怠忩怽彳弨恞悄悘徧帛徸恙愓惑怈愓悧恏惾悝扡廙憒府悑恉怜怏忡怱憋恒惃彲悋忙徭忕忶惵徣怱弉彞弤徫恎悺挧德彥惂怏忚掾彜愅恙徍惄徧愓懊徇怫怖悖廰拹恜忱恺廬懣徺徛憗怓慐恓愜忔彝彟憓弻怡悈延庺很恀徵彪慚彽忉愎惦怾弑怳彌怠怳悄彧徕恛怚忒怇必彭悞怪徘恕忣怗忳忇徿怣忯您怆忀彷怬徛忮徝恼悋悦御彞忬悇怠悐怜怼彲彨忎怓恒怔彶恫恪徹恉徠怰彧從彑彻彘念徉恂彺徔忇彍悆悄怅徯忩恒恬悬忢怆怭恘徺悭恫恎忢忴徐征恙忹悭怺彚悂忡恣忣彚很彷恘怆徝徧忿怉彼彘彿従彶彷忋彼怶彠忛忌忻徛徽怾徵徵恞彛怫微彸徱廮怣忞徜悵怐帇忻怈徇必忦怒廂惣彨御忉徭怢悴快徔庨忯惓弞强怀忮悇彅怴微弲很彵役庨岧嵢式悔彶恑弛怋廃彖怘怟徯弲惪徧幕恶巈怪恜怷悒徥徉徾恷怦嵜悅愢幙惉忚差悌庽彮徏彽尨幡忡役悮徽徢怩嵸嵰志悞悑恽峱彺恠悦惴廈彮愃忏怊徂彸帯悩彺惑愠彿恡志怊恓怓悝徳彑忇恨悝惖恅廧徻恭彰希怜悖快慹惏帋弛幘廗恺愍忂廄悠嶒恣悟戸忏悩悈怸忾嶸惉惀懦戛廾怖幚恑性庁巵恓彚影嶪恃弔怶彏慫巽忒恇彎忸悝恴嵅忛恈怈惇忉慄憉忏悿惚忀忹慬幦弒弆彠悞惥怛悍彇徶拾悪微揕弾徯恏悒念嶁悾徧弖彉憙心役戀忱忳您彤帻帇怵徂惘庴徒後彗惍庤幃庑恺彨弝微弓恣弗彴恥待怦恖年怺庣才廉岫惲怞悏怣悁庂庺恰慸弊態悫恃想怵恤惗惤彸怹恩悞慕幢忆惊忻悹忟戨忥怄惩恸崬愧慷憀并徦恤恥怡悮幕惈廤怗悟悓忰嶻忚忺廅怜庨悟忙忢惡廨忤惨忣徆廷恉忌患徺怐幼忆憆戀惇慷悑忞徧怇彽恉墸廿归彛懇忚弉愖慙廔巣恺忎廀彍忋弓惔帕彷嵅弶您庤峒怐庖怅彚崝復恟廡忹库憒意徳座恙惭慔帩徊忱懼恝怗抍慑怵底弖惆廭恁惲彚怜度怑慻怏愤徜忁徘帳快开恀彽彚忛怐想愝恧帥廲怇悅怃愡庣悦惆恣愤彆怏巌怬怦惥征廔悒怡怆忬怆憡彄従悰徽忋忿徧對康忑徤悁恒愩弹御懍怒急挄感怨恆恸悶延忽恍很快愑忪彙戈忈彟悳幽恡徲怩慇愑悝悗懏忼忢師怵庶怜彭怎廯彞徐忄恧愤廂徸愉從悯弚慡恼恌恼忉廵慠忽怙恽必悒恟彷忤徵惥悞怠必快怣怭惲悈必彉後愁张怭愥悀恙愣愘怑彘恥怣弣弔彮廎徛徙悫建忙彜怗忂怉愃徽忊惈弨怚弮恑彷怚愢忝徉彪恣徺峸忱恽恀恌径己悆怗忆怡悆巍廸愄彰慢恡忹急庐待弩悜惲悴徿徲忋悇恩忞徚悭恘恪忀急弖悼愎得恘庫悎惲忣悖惰悓忝弌彫忟愩慕悀廮怉怅弝廎怾怙忒惇怍徬惀惮怕愧弻惣弯忩復悈悑徣怤悙悠怳彠弰悹怂恻彩悋徼悩惞惘庬忢徏弾徜径弰廱愢惶惏廻弦彶怿徟惿愂彉惹惊忁愹弶悂怞悎愨怃惌悋悂廗岖恖怆怰忳愣恸怬怚恅悧恼恦彳恊忱怜怛彧恐廑怨徙忑愞怶忻廤忚忚情怙徚愡怑徿徇怹庠愆愢忈愙忱息感忿径恾惡怜弖愬怭总悶愆廃愌弾徍度慂恷恘惄恩彡悛忸悧怩弔憪快愴彶忦惋恻恃恱悳惷彰恀慇怔弹徙愡慝得愽慼徉忸恣弊征异彻怔愔愖恎彴恔弥忩惟悦惖恲忱恨彛恾彛恺忌息恻恩悜惙恕弳岧惉慇悷惐悪忌愡恢快恼惙忑忚慖怋慧愈弁恃庡恩彫怎忻恁惭彛彟惸悡思徘慂忿愚怿悳廷惚惶悛悯悤恀惓恂彜惟怡忇怲徶愘恸惟悯廠惸归忬彩惚恞弥幠尉徨悖怈役弯幓廭恱徨彘廴愗弉恿怛忤忡怏恵恵恉彠弾怀徻戟弃怎忮怡忍徎怕忿廻彗悌想座愝惉惩応悸很弞愋愆彚惉悬彶心庋怬徚彰怹恻弶忝懴悲惇忖式惭扥愌彬屶总恃愉怖怟弹廋愓悯庆忍悫恝彬忋惻懢恀念恙惓恆忔很惹悷异怇弨惋忚惥忷忁悉愩怈彯徝彼悤徬彍恰徰彄怊幰愦專徂幷惌悑怎愊惦忘惄悟忀徣弓恏怚惈強彄必恐愈恭恪悖忀徭惻怛恀庵怃愭怡惌思廹彄怪忑忬庞恚徇惘怘愧御忍录怿悘息惆弞悓怦忈怳恃惫彚患慔快思恥惲彁嶒忊忙恧恀愒怠悛忝怣怖徻庰弛恲怒慓怺弎悾徐弲徨惡恞悂悡忶志忛恥恹忛恋忘悚怊快庹恈怔悀忻恔忬惼恘强惜恑怲弭恤忇惶悰怶弮徨徽徭徰恶廒愚庝嶻忦忀愥憈德忄怤悃忙彾恚彍建徛廩恆怘愻愠怗形忑恤悸悝悽彖快愣慅慲強愆彭徾怙怿怺弌怭懦徟惐恍恞弛意怞恛忛忺憝忯廰徸怜惍快忻怂愗拴慌惟惒忟悗懫愌您嵒廋恐怡戭惘忾廏悕愖悀恉怠恱庠彠愑忮惎惼恎悶彛惐怜忆徐德忽悢悻弾愽彃悶怪恚怅您彜恜悳彇异憕徎廄度忱惽巶悴悐惇怣怞思恈忊怿彊悬忤往怴怑怖懚憳徚弉恠恮怇徾恺急怃恷巰恖徵惪彾愃惿恁弢幣戱忄恫嵴彎惪悬徢弗愣庲巵弁念悖忉彂悸慴恂怱循彌怵忴怗怺忧悲慊悋悉悭戫徳惫扩康惜彏弔徿挚憍愯恡彴庢悪廐忚怼库怸恢徏戧廲忧庱徽您恂徴恟徝怹徔惮怌彆弘彁廒急恖怲戚忂怱恸彞愛彥徑恡忳彔恊幡惻悙悬憭悤恽摉廙忷帗廏慙忭扽忎忒很恎徟愅弑惔弰怨廽巈恌怽惉归彣恲廁惇悯庄幏帥愶御愴応嶽惌恀悖彃往愠嶱怭悕怅异弤悓悌恅徥悖戂忐悬弰彆徔惧律廪广彫廪悴愳擪庽弿慬恝恄枸帙惬忺惐廸廷忱忤恿引惫悈幀撃彍彭怎庌怸彟忍悕悢恋忮忣怬怎幺忍巯忶徦悻庰径忟幺怰扤御御愮心廾庶慈憓怠怮徫幭怐彗屑幈忚怫弫庪怰廟悇懌弘彳弃恴志忁恳惆彗恾怠庘怬悑愞徸惕愂弿屟廷庙怠慮廠怰怲悆彅嵷怿悊廪徛恺忔強悊恇廖彸屟惨廒恅悸岞彦弇恃慴慦恟復忇忞性弙愅快庀怑慚幎屠恗志懣悍峭崈嵐慵徶彙弚惁幩弢廔廰怚崟庒怲忡悵岖怺屘怤惆怑巠恺彧忒忮愀弉往徎庝弓悍恜悁忠廼惝庚嵑怅彪彝息怂快彳怽怪恤彤总径怀怅彏怬忄忱悆恛彩徹忇怒悄怗往徇弿怓忑弿悗怺恻恩彸怎心怘徥彔徵彣彽恆悁恏悑恸忮彧恜彪怲彖徹忯恗彺怍恐忸彽怒徾忡忺怾恷徟徠悇徜恓怮徒恺忭当德怈彇悖恁彸彈彣悃怾归彼忍怈恸忸徜忲忕彭彯恚恕悏很悏彶录彎彏忒徇恷後忋息恖怶彆彩徂怪忥徝怸役忰帱恒怌廫悖悜形恳恃徜悚徣悇弹怢忆弦恭悁慖愀愜惻快必悎怩忕彙忰怴悃悤惪廲彬彐彽录徻彌忋怨忾悻彧恖怾彲惃怾想忪惐愫弹恡弍忼恐慊愍彿惿悑怲弼峍慔怏怍愵愋彣恞待従恾愭微怂慔怍愕悼廾恖廚得恮悉愿惮徹徲恇恦慊怣廐惼忼总弼愳帻意悐愞愀悄怽悂悙怪惞愾徫彐惥恗悌恣恴徆恁徐廄心惣悬彵惱慐廐悢徒恋恓彽恅徯惱忄恛愌愁忛愆恵怣廱怕悿悬怡录恶悞态恟忐廼怌弨彴弈怀怚廳慕怵悂怘恼悓悑忇惟愎归愑愥恖惣怴忶怇恼慣弜惌惣慠弿巐忩悼忘思怯恊恐怪悏愿慕弱彯恳恏惎愫彑徦彧恗恁愔恀愍悦廛悕怞愼忔弡惙恗後彔悐必恿惡惢愬悭惆怱悯忹惿怲恹怑恬惔惋憁怩怇徙徯庸床必惯廰悌恪庈悷愓急怔忎息廑惯廴彶怋怶恭恶愁愝廛廧怗惚忴庚愺怀恦惉忶廃徭弽廈循忿得徂恮悜愽彫弖恀恵悭恙悦怸总悴庥愁徶惫性怺惬忟恱怃怌怈岖忲总怡悚惹彽悡彖忔恕惚幝彬怲怩悗忥态惊弳彡建怼惒怭弊忿很怫恋彋徟恱忲志弞悻庿忛慃惤怄彵惠悳悅忊悽惛弉廲徼怿恺慃恿廰悪很庎愐怇慃愻恡戠忄忹庨廜悿惩憥弳忇恙悵恈怾彥憖恊性帺得彂怔廄慒徘悺徤悠憖幌廭徉恤忪感悆怯惝忥悥廗憳徉幓恞恉惘忀弹惺忉徝愉忻愅悄怺慥恗怌憁彉悊弬廾怖惡悡开廱彝徫恖恺扈恳惁恴懆庺弿徼弭悜弈恳忧幺憙息怔恽応徆彁忺怨怭惏忥彜徍忟幊彞庡怚怶忷愵彰怵怔恇憹弾惶愾惌忨弃惺慼恙惵悈常愖怋幀惶忓彈怙庢惦庆悯怿彞恫怮悃影忘弦庐弜徝悭徠彘快恬庼忂幆嵫恀幸式峴忏応嵵彌开応嵉恪徯恁快恻彊弓徖悟强惰怭惮怹幼惡悴强帹恛忐彷彈恒彭惆怪恲弻峌徘怔慞徛庅忤嵼布恣惕幙帅徟徴恧忳徒恎廼徚廾惇廊寡悒忦彲征慻彘従廤恖恭嵾恥悲嬣恝悒徜廏尋嶨怺廎怉干幮徿怟怅怒彍弯悝征徺慮徼悛恬徭慙得悕悂恞憶怶恊恢弡怛恁慃慸恧忔怓惪徻忠形惎彭悛憖慴惂憗慢慾懁怞幷彽彃愲徑愪怯弚徒悕怫怑怞惣折惟惄徠徝恝恏彺忀懲扈徴忼憉忧忄峒徼愈徘徜悫幹忪徢惧徧忬悰徭忱意御忎彩怊廖愠憈徖惼廊恎悢忘惺忲悊慟彡彼愈廲惯彏恣恜惧彚彸戌悪庻怸徂恰徧恸惀惏愦幘惃惓开徯慊廐念恑惞徝徿慦悪恤彤徟怃恀怛怬急徐徉弶悮悔怯弓悬惗忣怡忢库彐徆忉恅徿愈忸恖恏愢彙怕忿恭微恺惪悊惩慍悫愬忞愪恪忄怸徕恻忏怮恭嵨怯恚录恞慈忛忔忛悔怽恌惄彴惺彝怆悛恈悙幺态忷悯悵恓愽彲弯忑怃忪怺恄忻惥忛怷幜悙惟怾恖怵惝愅忕徙息怶征彡怉怠惛怐恆忮怭彛弁懗怤忶悥彇恠幮庠悓悌怈怵怟懞怙恽悳徳怹忤患微徤恫悞怴忽忁悭悪怘忆忺怲惴悯怚引忖憷懍巷怠府悂崭悹彾悋必弡廑惋彦惆忊惐憯憌愓幭徿惝徕征廲慹挸忈愍悈忘忔律弢怠悸徔忐愂懽徻恹愓弿恈惜巅忹恚惪悳怸恺恀惶恉慄嵤慑悡恞悤急忔悮徕徐愻忲忱弧悞怘惂怏徣恼廤廫恧彫张峭怲您彰惿悑悔愚忩往庚恦弻怊慥忾怢惇恊恦弥愩忈彼患愳徵惃忔憖応怀巑怮弴恃恈忥戱德庵悢恈悫廆崳忲愘惿待帕惨彙弲弔恏忏恱弰戉廲恗怑悟径忆怹慸彺待彛抽彝悰悲愖悃忲嵫徒彟庂徺忉峹択抈懙忸彏忿帹底廙廮恌徱徛廬廍庖弭惻惃恹当忒忑徕悋弑忺怐忾廻彐彴怡悤战忓怶悬彨徕徭悦忣恧徹愂廅惧愔惚忀悲幺忍慻幪急怷彇慗悬弻忬恃悋廟徍态恳恞怼悄愝徜怌幢愧征惣怫惕恒恀忁怌怢憛弝恿愞悛愄延忡忭彈悔恕悩恚悜弨惡怓弻恇彆帜怽彉恻忬悼悉恏戈怚恜忤忳悧懞怦憺彙弥惋拳愆怋憇徍帾怿怜惯悦怔张恣恉扚惶惑忺忮恚惮徠忑悗惝後徍愮彟怃忾悒悍役愍恶廪彨惪惪慄慅忹往彲怐忎弲慷愼惪愝彚悲慃愑悟幩忟恑庉忔悢恆廂怄恧恦往惆忶恰廏廌怰惢悾彶怭徺户忮恰嶔巤弨徦廼很惂崯慓愻恈掘惉憗廝弹徭彣幹性心摚彂巸弮怅惨怤循愱憚惪庒恧形忘恿忢感拭忽徎徧惏忎捲悡惜惮恖徛彁惒成恟待彪廹悀敯恓忼怢徱憲幪怃悭悏怨怸嵖惔怜恓懘庬恊忷悃强怫恋惫慢扁异忦循愘常忰店弢慮愧悂怕引徧嶠徾忸恘恣恟慐弆悡惩恉彨弼怍惣怈忳恉惨彲怤巡懥弴悧怒怲愈弤州平怯慢恫常忾悸恾彷巧愿怨弥忤怦归悴弡憠怖忼廑忡怊忖忽态廳式悬愹悐悲忓廅恄怦忴徃恲崑府愦崐怍愇怆愛庁忔屏废惄州彺復怍復庐徺廹悤弇怯忝恦弿彬恆嶓慉彆悝怰庺怮忳弜才悺悵弑幖恘愇怶恆徻影恪帲悷彲忀惃幅徰弮嶤怍忄怞彤廎怡廲悊怾当恥忰悓悞恓您幦忲怈悁悠弗忧彶徖徥惖廙庋忡廒弛岖廔幔徘恮愁徻德徱忏怬恤彡廵徭彠忛徃帉怦忤忸恟彙御惣徐徼峏悸恿徎彶恦廨徝恎怐悼徤庉廽忖往悡惩徠怼廜幚徯惟恾怣异彈怋惡惚忟彐惢弓惉幮思幏彖悕彋惻悖悍忹惍忘惙怖廘忿忴徭惬惪怠怛恣従庋'''

fc2_bias_shape = (96,)
fc2_bias = '''愆慔愻愆徐忇悂愚憦心愁惬忺怊忏愊弲当忱怙憈愂愆彡徠悍恱忳形怔怣彄恽惶惶憡態慹彅徭彧愃愄憢愡慞彰忣恸徭恂忾悻彚弯弆忩惺情怼彾憔怌怺愴愡忖弞微愘怊怱徸怒慌憆忾慟忑怺彳惮徱憪悶慔怓愇徴惤恏怅弄弅慄怭'''

fc3_weight_shape = (64, 96)
fc3_weight = '''恽怞戅惧帇弮情悞惿彌扛怜捛性彛慾徘忪弜徦惾慅愚忛悶恟帔慽德戄惃忐恵忮怺愹憝恇弯悠悬廖惵惾憊恰恫怴嶈愕悯恪廆幫弮怽悶情憏悃徹慏愷怰悦悝弸思恪惐惽忥徲悼惔惓念怐庉愦悖戝彌慼憯愿慚懏徟惬庋悃弾怎憛惃忸彋惃悀弽忆影恼役徏忄恎悑徟恝恹応怀恶忮後悔往怿怄徟怢忐恲徤怖怙弯怒忙弳怗怃忹怶忁彆悸徴忚忴惍影彿忙忌悦彘忛彔彺徤忋悑恎悭思怫悽悤徍往徢影惆怱忀忆怓恴悐恥徵忾恿怇惂徭彞彐怐彂恡怩忬悮恌忏忂徵忇惩悛惡怗徍忼慁愛愊忚愴惰抿嵣弬惱彘恨彟怅惔慯怬征循徻幯怄彽惦彽廵悃忪憃惟悆悈弭徐悾应惶忼怕忷忱弇廷惺帰恦徎工応徏彾愭憗悡怰忯怞幣悻怂府幑徼憣惓悜彶悕惪慆廭愴幋扔庺悲怹愑忲悬怇怼影怕巠愑徂庄愶怏慸惤戸惓彶幐悙怏惝嶳惝弽捗嶓恙彂帳從忷恻怢往悤恳崃忿徸彾憠怖忢廱怺广恮思忆惔忿忐恎巰忎总惘徙忘帣廯弦嶋悢孬嬒怙弐忒忼慺慦忣徹彣廯恵恥年嫹悓惬庻弟尘恃忀彈巌恞幾惉帝怏悫恝彽愍彍徢庐忿徂忄嵦孃悩怠恶很恎忠惒恹恦弼怆徔御彬惶悫怡恳彌従恙忇弰怌悮忷徰彪恧弼怫恺彷彀怤恏怫弛廣悒恁彧徊彵恘悁恘弖徑徑怹强念悬悻忽彳徯惈弡恾弼悐怀弻彑徫彫恂忐悀徧悑悒彃怬弲忯怺徶怩忳彅彑悥忻從当忯弳彷徬悡彴心弶忛怩惝恱忤想必忊恠惨悜快得忸捍岙廋愅忮怏彅悷怊悂慖恕巽怃帮惮慛悪忻怳忂愕慺惸忍慰忊彣恅徯惉悘慕恽彼忰忪怚廇悓幩巛悶库廤总懤怨微悖悖幓慴忽帩廼忠愞忿忷幺恛忼忛录悽庲戣庞恉彂愂愵惊徻弬彵徍幚恵徊幱怫忿悂惼戄慀嶦帤愰怣惜恝慜惟摓嶶廢恊庵患庩彼慎應愠忻恖悉帞慮彈愗怍怠愶怐憄恹惛恶引徚恮帉怛惵恋悱忈弳崱慭彵徝弬廛徒弨弭惙恒惿怜恾悁底愒息崌弩役愢怄慿彦想怞愉弘恤帮愢怉慟忎慛悳愩愀怺彃恝嵹恮往忘懫悇总惡惨悭弛惔悺徔怜幜恧悋嫓忘怲怋徍忶慖徵徕怢您悚帎彎慯差峯廢总恪律忇忲悮恞怆廆恣悤愂彖彻惟弰彨执憗廻帨忈愤惡怆征廴忒引恁徹悠愛慀忹彖憆库忮怹屣慊峞徾徟性惍忒懦恗幒扆忩彨志彶峁徒惹恿愆恩恤徱惮庣恏忈恦弹彜慸彮徑怲德惗徦搷懓恣彖弌怅忆恰恝廇怳徑悦恕弓廛愕恭忥慛忉恰怯悻彫弟悚悈恅惓悠很惜悡怷惜忏恑弰恒律悸恊惨弍恔悔怔彑彣怒慻徖怤必惦恰康強愑忥忈怜怫恔弧情愍恂忍徺彻彆彇怩抹懈怙怃忝惾忁悙恜待忹影徛怓恄彚徇弧彍悋恟念悒德悕恂怀悙徙径怫恖惊恟彯恧忂怪惌悜弲徇德怨弦悙快悽徶悆徊彑彲忼恐恈忻悪忯忰悕恄徿恥恑恃悗怪彆悵恗怴忔彖弨忔悀恀忈弰弘徂彨悎恕悛弼忱往悶彊恀怇忱弘恤恤恾彑怲恴怯彸彨怛悖忻愜慚恂忢忰慞愤忘恜悄拌廐彌怽徍忠怆悪忼恇忪徥影恪帓悯惲態怉徺愡悲悧怎怑惔彸悺恑库愺慇愌恙急弽帬悅幨徬强嶠怘廝悽愒愲恱忓忧恪巵愎惯庿影彵息恮愣幨慟意惩忡怏幊懛幷惁恽恒悆恃悺愘归怿帜徿彭建愸慕悗忡悝悎恌徲恜徕徕恠応恒恟恔恒彍忤悤弩彫弩恕怲悍怰彇忂怹恮恥彊性復悍忳当徃彧彯彸怊忂怗彘恏徉形後归徰忼悡悓忤恏恰徟忑彛徾彞徭恵忥恈恨彊恞忘忨徚恣悤恧弟彛悵忍念惋恉忄彌弐悇復彻徆怔廳怮悮怞徂悊悂恒忴怯弽悿彑弲弛恊弩彳悡径彜弝怓恎怠恕悪悠忢恾悴徠忑弽恸徜忾往忕恢怣恌忏怠弥徉徶怣悐彖恙快忂弳怸彗得悍従急徤德後徽忞总怅惀恚怖悋怶彔悅恷征徎恆悔彜忺怺弲张怺恣悀弲徫彽心恑志悦征忱徍您忬恖彗彑弰忓徖忋恃忶忏忑悓徯悉怗怐悰恐怬悼徛志徬怛忏怌徵彰彅徻忆怸怯徜恧恱悿怑彷恴忧悠怤态录弻德悤徣徂弸恦惐恙從怸彽彧当強恭恼怵悴悏徥悎恔徽徒恿悚徤怍怲彁彨徥彰彰悜彔徧彑惀恈徣怆忣徢悰恛往彸悖息强彌彛怎恓慮戞悕幐彏愶憋愅彋惌恇揲嶮廊惔廔悓怘彫愀慭愠恁忬忷嵎怛強戆怊恓慴恣憅愈愶慫彗恶彫巌惚懜愮憜惊弐嵡憙廭徉弞巭徑度怉惱懂慭徒憖总幸愭悪幤彰怾懞慚愱庴愵悉愩徚慜座惧忺慙惰憢慳憨懀恾年慛巄愇延彴懁意忲忳崘忌惄庝律怚徾彜寝悤悏惤弿惑态悵干惂忮徚惙忼恽悁志彈徒嶥径徹徖弣徳往惐恭惩彘忟弹径忞怔怎恷廑幉彶徾悢忻布忡录惂忍幁徖忤悎庤忛彸息建弓彰惍廴嶧忲怡怋恤弔彷弧惊忊寯怖恢恵恷徿弍弜怙慝懄庚悃彫惖懄愎慀憸徫怌慿悉恧張或彌捯幢彜念忛忯异影惈怫慗忚引弻庱愒忳感彾忎怘怪惙惦想惜弞忶彞廤恷愐惣慠忶庂幜怔忋怶差幾彪徛怘恇戛恍忥悶恁忖恲愦廪弅徫悵愒彋弄怒惈惆庤悞幘懕徠您悤怬怂憶悽憅從慹帗忙廊帿懡悩悞彮恤悱悤患恮忙忳徊徠忤徤悒忊役彡徨忸徾恡怄悘彟怤惎得弿忲忞彗役忁忧忒張恤彾悔忡徰忯彽恓忟徹忠彛彭弲息怑忲彭恓悑悹惉役恝徦徭弰怠惌怢患徸彵彈忨忰忈恝彻彘恩怋彰恛徜怋悸彁悙忠彛怦徥忆恗恈得忄强悝怢悳強忉怙怦怼悤徍役弿恷惊忄弓悖悽恿弞徆忬悽張忌恱忾恐忬彝彄弴彪彂怮性彄恤忌彗怱待忆悇悬彂得悓忊惛弛恥怒恶忥怖徇徹忏忺忚恲待悧恩弿忒悒怖恎悧忈忱彤息怸忏彙忿弪役录恬徖恈彜忎怑彣怢徑徣恎悿弹恓悎弖悏怮恅怔徛往息彔忀恟恣張徑急恴徦悳恶彿怉彾恃悭志怊彋徙性悅悶微悥怯忆恅怱心录快彫悮役彮彠弑恐忟忣恩恎悪徍忪惃恍悂忏恌忣惍悐恏怢弮怢恰彨彋恋德态徎徴弖忀怗徱忥往徆恴彎徃悙忄徦悂彦怅忯復恴当忀徰悲弢悀彳徶待忹怸徚恺恵怫恵徨忍彈循徥恺恋徙思悉恄弝恃悯怷徿惃怬徃忴弬彤応彷徼彏弶徣彾忠彍强彽悗忸彊态徛怜弿徟患徽徺径彍忧悀悃怆張徣很恫恰忝恤彫怅弴御彫很忍忬徐彃忆彷忐怌强恝彣怕忴恶德徿往得徧恋忬弑征庭弾惸您彮徏息徒忆彉惖廙彜怃恝悛悲彵引廱悐悿忚弫悅慤廾悼憴恾怮悫徺忯怪悗恿忢帷彛彇彎徜悔悅悼彼恗忹愋慻怱忴恖彲庎徹悢恚怺忧弙恀徹愿归幏惆慥惕彶徔徤恴悼廝惉徢悸悎惍惠恘愂廠悼怘幢悂彲愂恓嶱徬怗忐忇怯徲弼徎忥怰怀彝忨恪惋怆惡悭怈弳恟悔忸怀形彊忸怇恀徏悉忠彾徵怃彎悉当彥徖忩悆彧彗彠御徥徵悬悇徙怀徨怃悾徔彊怮忟恝怃徲怉惕悧悋怘恣徤悵張忎怱怺忤恣惂恶彑怲忈悟忐徥恸後恊恊怂忎悹悃徵怔悈徰屺彑強弭捭惼忹怗彈惘悢帷悍憪戅怛帑彬怳怪惌巤归恕徻恣悲憅悚懻恴怐惊慜恌彉彙徻恌恹悍悟怊悕悱忏悸弻惑惗惣恧徽引循彯怺弖悲庩怔徘弥惌惨怉巋惁悍忚懑岹慞怯惚徇彘很怱懿慟弤悀恍徾悮怌憡恛忭庞孊意忻嶔忡惾徢悮慛忏徻恄总忡庈忓怴慘峝恤惖庄徱怿彻彽忊忄彚嬏忙忮廫感徣怒嵈弴弘徢彫怏恘徴徟徒恙怙怷惚忊忎征悙彈屖悓崒庈怹彥嶎忠惭惷恇怰惉嵷惊徳怰姭怺慯廽影囸想忤忊庎循徭弄囷徎怠恊忨恙憲嶝弒徯怠愛廷嬘憮怱恧快恧惔徕憪弽怨恧帞彞彳巘戴徤悜强弴慅彷怆怢悳惈恚彐惍尵嵷强恘忛忪婼忸怙彻忞庅強徢悆怒怽弪徆总愹憴惊廟思愰憓惝恵幺徜恉慱悑廊愐愿忖忐怂廘忐彜峬慷庀恢忸悌慞忳愪惡彐扞忣恴引怱彻彸廓恆愶悚懋懃惥忊恕忋悻怖憹恆徾怴恒恻忶恬峉悾慉徼愊恸愝怦怶弍恚恰廳惄戀忞懑弄恾惚弾恢弣恕恏悧戹怬徾悾怩恳彬忀彅悠扞幄惵後憂懚徸惐彪弧怖怶悍忙忴慩徉惈慅怐忦庿怈徛怣悭忖怪彽弱憒忮徤性忔悦怨悜恵悦態忂挃您愗弆忝嶼愼恈把恵怈恓怞忣悭怬慊彉掝彨徧恰怯恄彣彐怌徏恨忍徭彟廳惼忴愋怓怓怪徥愿忍愚惨弩彅忷引恶惒恪悦彸彘彡怋廳怮式幔恪怩恓惹慱怛惆忕恣惶悫惼弼御悌愮彳弑忔徜悜怆忮愐忲徯惹恢彾忹恺怖恛抶恌悶弁彨廖彬憃忩徤忂悧悶悍恾忈弧恬很情悭忹恶急怹彏恼彤悒弼恗怇怺張怹恅怶恤悊御從怒弼怼彍忢彵律徍悍恊弿彃恽悴恀彳弶怍彘忕悓恦弶怢往悺念彙悒忚忢恂恐怟彧悘悪恦恃徊怆弹当徫悫徑悩彔怩徎怅忐忶徛悡怅恵忽悅怆忠怣惍怸怿愓感恔嶱延态慏惥恗懏愁拉巀弹悮廥恗怋徉惫悏惈恢徂惆嵸愖怤憧惑恰恭悒愫愺憈愢廮彯彡庼愌愚憬惥彑弧庛愴恕怱從彠恡廯彣慖愋惢悱怰慬廑恩慚嵾序心怨息愕怍慅慰慚復怞廏悃恓扉彷慴念慎愩恿弅惚幍慼年廝戲忖徴彐惚忋废扃忯恫情快憥恤恇憵悐恆惨怛憯忷弹愗廝怮慉怂幰彨廥惴徇徝忁微弪悿徐彋底忖彬戒徔恪徑悖悻弌怹慇彀悇恒恮彖憶徳忨惢微徾忶循惽德弐忪憏律弘恷愣怪彙徥彃悼弴戗慇惈悩彄怯式忑彧懋怸怱忠庉扖憸忝彷徺忰忈徊憍怍怅廆念忧彮徱弯廖悽怯徱恡想悈彈慟徵徔廲彯愶彭廯廋忬恴忘弇廾弁忐恄忂彌恎忹恥弫怬徆悡弾憳彔弄徠愵怪徇德悜彪态彉很弙徊引恰忉恷悬忽弙彗庨彋徍弼忕座廆忍忢总庿忓怞忥徣徉彨恘恮憊徛怰怊幾庩恧悍异惎惨才彴很忰忽彪帏弣扩愇怩弛惄慏恰怹彦态忶悻怃戁弿悶弜得恇忔悵徶忊恩忡怷悐彻悸悧彵恰恺彂悽慡怂惡彊徖忆彀恊悵怭恟忿忑彣忣慊忈恤徧悧徒徾愝彉愳彝恩怭悥彍懙慵憞愶彴忁彚恈惌弢恫彨慼幱慫愱惻愋志弱恲忛復彄忓心徴恄恛恉惐彫怅彆恕恮彘忿彖悪惄恔彥恙恈恃弱彭後彖忪徸徘怱徿彥忇彰後忓彪彌悩忉彞恙怑彤徴怸徴忄怿彮怬彇归恆恥恀您恢怳徨徴徊恨悸恔恃忞忏恣彤怷強徸彔徛悎徕悓徦惁悏忼忢忴惑恁悆忺悙悈憸惆懁恕愉悁怀忿悭嵿忽彮嵋惼惐惕憪怹患怞徬徰怊悥庶忼戔庈恮影彘式徺幮忛悩復惆恒忝恍惢怫彔怢怄彖愓抖廿嵺怰弒懻忩慽快弴愝愥悐怛恚懜恘恏戯嶬悈怬庩後姷恽必徔悯怦愩廡婯忭忚当悄怃忎悠愍徍扈忩怴惝惋彆慕彿怛惠德巣役惉悁恨悿惻廴墼廼彉护惈徿怼惝慇循彘悗悒惃性徾恉忽恁怌恂悼恲怢恬忡徐怛廠弻恴彍怰惃忞怆徥慺徲恸扢怗愨忕彻录恊怒怖悾嵧彫惏憳怫徂徍忳总惴恣彂弿徐後怅巜幑惑張怺弸彙忦愶惉悭悃悗庵幠愥彁憩怼扅悛廮慓忹怃徾屍惷廘弴懙幉惐慣忰恅悡彺廤彽悦恣恽惛幩憺弣徊弫志孥忬忞忀忿惽彗彾悲惟悕悐彰悕异惠愪岑归彇恬徉悧悀忒悞怽忭微惋戄彜彏愗幽怞忕帥弰巇彾惑悺怉彞慬廌弬愱悪恺彦彨惯悃幛悄恪憖忨怩戫彭悟惬慥愕帳态愠惏惘徠愽忑摀彛廓慱干彋徃惞憝惖悫彁恪悗崩悥恰愫悥悆憅怤惨惕悆慿巼循微彍愼慅愀憲悓当嶗憜弑悴延弞弫弿忦恵慸恔悘惐慰幾惕慪嵺彋彮悆惗惊廲恪悸悔恎怶弸惷惑惯忖憥愐悼愥戢庤慟庣慠庮彩慂忬忱恘徧弹徵徳弨怹恊徰忙往悿悍怐徺忇循忛復忂怐怄恡弰御悲徢忎徺恌恍怷忾彀怙徤徬徯总怫悢恭彀归往恩徭彄怈恸徆彺悶必悝忟弟徊彍惊悞忿恭恾彌恋恣恭彤弯廿怀恰彿悜恮忞怫彯忕恝徣徉彄悽总悔强恅弸徖彧悄忛彆惻悁恄恲恧慇悇徿惆嶆怶怰庞忐彸怦徝怏愙悑彗愹忶悻彧彳悞媸庸彋怜恏悉宵弪悟徣忧徢悴彇慧志恸志恄怳憓愍怊岵悰徉怗张怓彅徬思愆怳悿必懊律怛怫幧彲憠媿愾彏忉怇彦抗忳憠惡忴扛怴役忚忈容恙悂忠得徢懷怛惯忺惩愜憹憯徿徥忲悞惐弢慅惠掀峡彍恥庡怜徽悄憑忘愁忙弯彀帶悆忳悴弹往慀必慰憄怔怱弨悡忦帼慁惛慭怋忺怄彂恒廙恵忞帿忳庩忊您憗怬恲憅愽幘愪惰弻彐忢慛恝怕幺怫愀惌廾悖弝愣彿惃彐恤恝悈惑恧弝恈嵣恳廠幣慢悾恵悐扔性恛役悽悞愲怏悥彼抿彀悚悻忏恝悏悕惑徽怹怼幾惐庢忡憝悺彻彝恁廳惏恪忝慥怐怳悽彰愷惄恵恂彷弦張慁廩思廌幣悐彈怿忛憟怎径徻恿徵忱恽廚廵忊慡怈帴幟悅您愎彨恜志恙廰弸彄愚応悾惐懷怠恴廜怯廤巡慣惎惚恂慢忣弓愼恾悤徆嵞怵惛岴愴弾徴您弸憀怒彪悇悠必府悻慪嵚庨廭悄憉怟巷彰悙弥悕弃悅忢憍徶彭恜彖悈愹懘忘宸彞廕悳忖悎徐忆恘慞怐怑怑懰恇惰憹平悉悁婏憇嬱彮徢悸慼忈您忪尨戜怰悗彋怌对怂慠忾惟悫悊惐懝悍怔從忶恘息恢弼德徑徎弪怟御忉徨徸恤恧急忱心悽忿忭彮悞忺怞忳悴悅彀徱悤彝忭怙怱忂恔忊忾彷彇徊征忛徽惔復徝徇恶怌徒恽恪悠恠情怯忆忤悎恴悒徱徫忯悧恻总怆恶彆彶忤徏忶惏悑恫恇悐悑忑彐徢悀忺悝徖徰彼徯径恹很憳怣巜埃彧忸悚彷廣恿嶁存嶋悒庶彘婕忠悟捉徾恕彵怡巽忕廏徻怔廻徣恦恫徐怐徻崠惈恰娭弼悗徟惊忽怠幱恪恪彼恛忚徻嶔庸彮怅弧悟怡愝啷忆恕徖怭悂弝悷戦惝徤徻悧壖悺噑帮彎扱徻怱往恜慊巑嶂恴度按孓徫搸弣慏恷憉恳年廞愽愷愸怡懫恇搻幚廃愰庂恄廸忆憉恒惺悼廤恈嶄愍惜懇忰徎恣怔慃情憅憼廝徏悫弳惜憾愼惲怶怲嵻悓後当帽庇忂廘悕悜慨懀彽慪惀廑慒恆弭廙怇愒怮悗幪恁憌憟弯憀帧惐忢憆悅慽愱懞怷慢弱悃幋恪廋弻悯悭悑怈忢恀怔尤惓怄悺怊幋惮徿噫建恡憆彈忤忒彞悝恖恚巰彨悥忘愥忈征忋恷憈恷态弹忷彇微恄彐忄惗总彔恗悂愽弨恚怍弌悿徬徤幷惇忤怷悯忷悼嬫悉惦情彝律愅得忲彲愧彧怿幙徏弫带嵺弻彼忛恨忡恶岆弣彅弬愄峪專惎徐彼忠待强恐德彣恰彼悥恡徳悴忤忰彉怏您徰徐悁怿怒悁彿忒恽彠患彜弲弻忁徺忼得徵怖忧悙徵弴恂悕恆徫恹悷忑忺恖恫必患弫弳怉忞悏彎怃恒怱弬彵弽徝悽怳心徂弿弫怂怞彮恍彔惋悂彼患彌怾徳忖悐悦恈彛怿弥忇悝惔従彲怔彄彮恥恊忱徃恒彼徍彸惄律忓怽恷忺忳悗弸悷弣怭忌彑忑怡彲弣恎弧彾忙怆悉徨影恎怟思弶性恐循恔彟弻恼彯悬径怙恝怮恻忪弿恬彗彉怹忕彤忆恃悷弜惊忺弬従悲徴徫忹忘弰忱怨悰录恓恠怗悁恇当忋徠径怤惂怿彞徸忭彟彐彅徸忪弰悊悒弼徫恋悃怸怚悶恄彋彦徳忺忨当悂恱恒徴弤必恙悳怞徜徆恻忔彜徥悌弶悂恬徒役态很悷忌恲悸悿徃怞恫惁恮徆弰悤悟怄忞怓忀彆徙彺従恙怪彙念怟彺彛恫従徰恽怳悙息彌恛悛恋弶怫彣徼徫忲往彺徍彯怌忟嶽幱忮弖徣愁惇巾惇徨恛徨徤徬惗律彻微徇恁怀忬孇怎悱徶怙您您戦悟弛忆恅弧恆廆恁怳志彉徇怲惆怯律彞怤幦徰居巭怳幮惟忽幊悒彩怘忖彃忞悛录岽忆惺底徧庡徛怆徛悞忈弴彧嶟弧恇想愯愀嫔户悹徤幝开廏専屨惄憙惰懿恢庾彶怷悂悺彬憯彦揆念庯恉弇彥忈怩惁恹愗恉忱悆延忶愝惭彬怊惧廈怾恢慄忱廃惏往帿悄愗慖恎惋徲廙愭底徠廠延息循恷愘惆憈悦怑慂恝愣惒幁幍徻愨悙悋帷怒惕惕忭慉廭惱忪愴彬悎感忽慃手彧慝庳徘怤庞懃徫恀弩抐惍嵇怄弥怼弓忊拪废彽悥思徹弨态巚悋彿忻彊徻惎怉座慙幐懢怌徘慉徯役悱愉忧庎徯悘巃忰恒愇彊徘幏廝恂愀彻弅彘恈廪岹怱愅懚悏弯愴恶弴忸弛彳彔徤愇慼怰忱怂彴忕徽徰峚恦扝快忍恅悖愿抿峉怍幇幛廙徇戴幒悺徳慵徭憾悎惾忖悞慼悬恙廑庪恿忯怗恹憰悱彛愍惸恨惄恊扸怡廲惂悔慍徠徑徽恉弰怐已恢悷憇彿忝怌恞徤崸拊廠往悥忞惗悿恊怮廧弦愝悲徜弯怄徲忇您崬彵怸恵庫弭怽当彭慻弧恖懭廟懒徕彷惪弚慣巎愳徵慠怰廥廡惾悫恶彃徫德属慝恋怒忩悍忬悴帉忙扃彗嵗彃悶徧徘惿弩忁悂惆幨従尭态怳慸惄惝怭怄恐怚屹恼忳慁忊怡忲恛心廐怪惎憸悑愊慘悍悔录徿忭恭彏彿彊愪忇恤廓戱彦忹懎才愠恺怞恨憾悵您悟恭抻彖当徕徬廰廻惏恍廅弴懹彀忛徆悆愧慢愊巺弼悚恗惭弒懽恚掋巠幔怌巇悅恄忞慡懓怺惈從怼庆恄忘慲恉徱慚彞慬怨悝慇弩彲忼弊慝悤惂忶忐弮巃悹恓恵徯幄復怣廮怲恬恾怔慁悓府惶惻幈彾恂懐怕悬忽惘憔惰徑慯彘戏怎愓悅悰怂悿憃悜廑怍崅悒彍幾憃怙忙往彜怃悬怗徵忂怸忲恮念当忽悗彀怿忣忓悄恘彳忣彤悾恳恷悛悬恠忌怭悞彈忯悀怯悕恽彘很忝徿徙彯必徍弹徴彺彣彵忧恠彘悭悛徲恿彭怄徳悎悂彛忮徉惐怪彸忐徿怢怪徠弿徹徠悔徛情徊徎彻彺彥怟忿彔忖怐恧忝彄徕彺惄悧弾怵恙怵彡惊彽強悸德忎忂弹恹彎惂弱徦惄怵彺弱悌怡必悏彩徶怱忕恬悝恞恎徝弸恒恈彿彽录怸弻徠忹恏恳待弻恋悁恆忿怓徽忦恾忧怠彆復悇怣彫悅悳徤悎徴彖恣微弼強怆您恼徶悮悞彬徙徯応归径当彌情彠惎従忀彽忉惁披慰彀忼悓慪惱徵愡悚撖帉彄愂徏怩廮徼憛惏憛彐恱徦弑悇彔懋彑恎恱彵愷慗恽愬弌徢悂庉憅惾悮悛怄廬嶌憘彞恅忢帨悮徾惗怲戔慱忡憋怆式愹想巒彯忋惞惸悁彘愳愔悀廔怋徝慏忔慘怂怯惝悛悥戫应怹帓快幺徐戡惰忬当怩徤弬彾従弥彁怴惃徂忥彏悵恒恓彉忡怚怩弲忏恆恫恴彧彆彂弱悗悃悓怾忾彌忲彦悩忝徙悭強悱徴彝彠悧怀悧恦徬弧弩忶情徝悄恋忭归忍忖忼惁怇恤恸彋悹心悠徢忈恫御悤怀悪恩徰徚彫弩息弪恷怀彸恍従彬悳忺恱忔彸彲悠彫惂怷怛彞彁惆弧忳恲忾恉彔徻态弲徻怚徇彾惀怶怾後彫徇忘怰復彧得恾怑忁忔怺弽怜徳徦忈怠徚悫怒徲恮忓悾徛徬怓怶徨悲恞弦怳悔弯怸忪忱怴恆彖忾性忧徖悢徕彞恌快彻心彧怣忀悔徜彛弪彨彐恢怜悞忏怋恎恦征彙彷徚彪悒怞彭恬忔恮恄徏忍当弎恄弶忖怪徭徑恞徶彈恾忖強忏忔彠忖徿忳彍怐彶忧怊彄彿忾怸恨忻忧怭悚忀彳忈怋悷悙恿恺忑弧彔徶悶悇彡怀悆恠悁徐彿忇彿悪徙悄径彘徍悸悘徠徦弹弹弮悧徳恊弪忋怚怳思恅怌悕恧彁恃待忶忪懒彑徾彠恬慿廏徲愯廰徫幒怼愡恤忲弉怾忯慎彄怷恇恎愊恩弪悘怫惒徵恞恁庙彮悤惿悴恑怊恺徶巘慾愄惀忚惊忻徠彫巶悎态彅怨弯徺懓怺忂张慲恼庿愣惁愿彥彻役憌徛愠抑所廽恷怆徲弻怿悥悃彬嶞度慄恍廯忩恛惄惰愢帅平愺恈愦惐慸怱拪徢已恷庥律廮惗恞惖惖悊心徰帼恗廘扔彆忑慑悈惈恫悕恕廩微忓庋慲愒憙愅彀徦帩慚恰恒庎廷性弼志慸愞怇恛怍憪帔恮愗廴弙彐怵慓愠惮惷愔愱恐慍弈慝忙憵怄憀慹怳憔懈庲悽嵥慜弡徯憸愀'''

fc3_bias_shape = (64,)
fc3_bias = '''愢思憐悕復憤懁归忢怆愴徉彠彊愳恽憟彳待徇悩徲怓恁愸彝徐惮徣懇恆忿廥忹怸愣怏愡径彠慺愌恱弩忠愷愴怠弢忇恃恣忡愅徥慿従徢惼忢恰徎悬惬'''

fc4_weight_shape = (4, 64)
fc4_weight = '''恲征愀慯恄憣惓廘慃悬慰怮心恃慈忖愦归怹急彈彩恗怉懍怊廻怜彈愱恨忷恽悄恈悢建愚忹悛慇悷巩怹挩慳應忔彝彖忋惞忘恀慕悜悂形悁彫怊悰憠愤慮悈悂慃徽怙惓廘悋怱悵得彿忚慓愑愣惄悮彊悊恟悖徬廁幚彇愝彥惬愞弳弍忴彭弿惔慠徝怄恴惱庀忘怇慥庁怵悦忡截慮戮弘悽恿忊怹愃彭恗悞徯慘愨悇悳愍忨悄慪怄愓徑悃悽急彤憁怫悦悑怌怇徹徠念廖律悸廣恰悔慆愩愠廞彣嶧忊幙愷悧惷惜怹忔恴挪愒悈彨悰恫愶悤憉嵿懦慕怐悀惻律徠恸怒憘惬忤惋憋惊憁悡帹惧忔悸悧恜征慄恂慝忔悳恃徉惸徤懮懏廇徍愹惌悄愞廙彨徯思彾態惟彥幆慛憌彨怨忐慒悧忻怱怠恃愃怿惝彔惶强怰愞恡得惍憀恃'''

fc4_bias_shape = (4,)
fc4_bias = '''惤总惫惚'''



EMPTY = 0
WALL = 1
ENERGY = 2

BORDER = 0

# directions
DIRS = [(0,-1),(0,1),(-1,0),(1,0)]  # UP DOWN LEFT RIGHT
DIRECTION = ["UP", "DOWN", "LEFT", "RIGHT"]

def is_vertical(snake):
    x0 = snake.body[0][0]
    return all(x == x0 for (x, y) in snake.body)

def flood_fill_limited(start_x, start_y, game, max_iter=30):
    visited = set()
    q = deque()
    
    q.append((start_x, start_y))
    visited.add((start_x, start_y))
    
    count = 0

    while q and count < max_iter:
        x, y = q.popleft()
        count += 1

        for dx, dy in [(1,0),(-1,0),(0,1),(0,-1)]:
            nx, ny = x + dx, y + dy

            # limites map
            if nx < 0 or ny < 0 or nx >= game.W or ny >= game.H:
                continue

            # obstacles
            if game.grid[ny][nx] == WALL:
                continue

            # snake
            occupied = any((nx, ny) in s.body for s in game.snakes if s.alive)
            if occupied:
                continue

            if (nx, ny) not in visited:
                visited.add((nx, ny))
                q.append((nx, ny))

    return count

def decode_unicode_string_to_weights(unicode_str, offset=12.0, divider=2048.0, shape=None):
	# Étape 1 : reconstruire la chaîne binaire 'weights_bytes' comme en C++ wstring -> string
	weights_bytes = bytearray()
	for c in unicode_str:
		val = ord(c)
		weights_bytes.append((val >> 8) & 0xFF)  # octet haut
		weights_bytes.append(val & 0xFF)         # octet bas

	# Étape 2 : lire les poids 2 octets par 2 octets, big-endian
	size = len(weights_bytes) // 2
	output = []
	for i in range(size):
		s1 = weights_bytes[2*i]
		s2 = weights_bytes[2*i + 1]
		s = (s1 << 8) + s2
		val = (s / divider) - offset
		output.append(val)

	# Étape 3 : si shape précisé, reshape en numpy array
	#if shape is not None:
	import numpy as np
	output = np.array(output, dtype=np.float32).reshape(shape)
	#else:
	#	output = list(output)

	return output

def decode_unicode_string_to_weights10(unicode_str, offset=12.0, divider=2048.0, shape=None):
    import numpy as np

    # Conversion directe en bytes (correct UTF-16 big endian)
    weights_bytes = unicode_str.encode('utf-16-be')

    # Lecture directe en uint16
    arr_uint16 = np.frombuffer(weights_bytes, dtype=np.uint16)

    # Conversion en float
    weights = arr_uint16.astype(np.float32) / divider - offset

    if shape is not None:
        assert weights.size == np.prod(shape), f"Size mismatch: {weights.size} vs {np.prod(shape)}"
        weights = weights.reshape(shape)

    return weights

class Linear:
    def __init__(self, in_features, out_features, bias=True):
        self.in_features = in_features
        self.out_features = out_features
        self.bias_enabled = bias
        
        # Initialisation uniforme U(-k, k) avec k = 1 / sqrt(in_features)
        k = 1 / np.sqrt(in_features)
        self.weight = np.random.uniform(-k, k, size=(out_features, in_features)).astype(np.float32)
        if bias:
            self.bias = np.random.uniform(-k, k, size=(out_features,)).astype(np.float32)
        else:
            self.bias = None

    def __call__(self, x):
        return self.forward(x)

    def forward(self, x):
        # x shape: (..., in_features)
        y = x @ self.weight.T  # shape: (..., out_features)
        if self.bias_enabled:
            y += self.bias
        return y

class PolicyNet_Numpy:
    def __init__(self, num_input=24, action_dim=4):
       
        self.fc1 = Linear(in_features=num_input, out_features=128)
        self.fc2 = Linear(in_features=128, out_features=96)
        self.fc3 = Linear(in_features=96, out_features=64)
        self.fc4 = Linear(64, action_dim)

    def relu(self, x):
        return np.maximum(0, x)  # ReLU

    def tanh(self, x):
        return np.tanh(x)

    def forward(self, x):
    
        x = self.relu(self.fc1.forward(x))              
        x = self.relu(self.fc2.forward(x))                      
        x = self.relu(self.fc3.forward(x))  
        x = self.fc4.forward(x)

        return x        
    

def encode_state_full(snake, energies, enemies, W, H, MAX_LEN,
                      max_energies=5, max_enemies=3, prev_dir=None, flood=0):
    """
    snake: objet Snake
    energies: liste de (x,y)
    enemies: liste de Snake
    prev_dir: tuple (dx,dy)
    
    max_energies: nombre max d'énergies à encoder
    max_enemies: nombre max d'ennemis à encoder
    """

    hx, hy = snake.head()

    state_vec = []

    # --- position de la tête
    state_vec.extend([hx/W, hy/H])

    # --- encode distances aux énergies
    energies_sorted = sorted(energies, key=lambda e: abs(e[0]-hx) + abs(e[1]-hy))
    for i in range(max_energies):
        if i < len(energies_sorted):
            ex, ey = energies_sorted[i]
            state_vec.extend([(ex-hx)/W, (ey-hy)/H])
        else:
            state_vec.extend([0.0, 0.0])  # padding

    # --- encode distances aux ennemis
    enemies_sorted = sorted(enemies, key=lambda e: abs(e.head()[0]-hx) + abs(e.head()[1]-hy))
    for i in range(max_enemies):
        if i < len(enemies_sorted):
            ex, ey = enemies_sorted[i].head()
            state_vec.extend([(ex-hx)/W, (ey-hy)/H, len(enemies_sorted[i].body)/MAX_LEN])
        else:
            state_vec.extend([0.0, 0.0, 0.0])

    # --- taille du serpent
    state_vec.append(len(snake.body)/MAX_LEN)

    #flood fill
    #state_vec.append(flood/30.0)

    # --- orientation précédente
    if prev_dir is None:
        state_vec.extend([0.0, 0.0])
    else:
        dx_prev, dy_prev = prev_dir
        state_vec.extend([dx_prev, dy_prev])

    print("state_vec =", state_vec, file=sys.stderr)
    return np.array(state_vec, dtype=np.float32)

def get_movesIA(game, i):

    move = [True] * 4
    x, y = game.snakes[i].head()

    for d,(dx,dy) in enumerate(DIRS):
        nx, ny = x+dx, y+dy

        if nx < 0 or ny < 0 or nx >= game.W or ny >= game.H:
            move[d] = False
            continue

        if game.grid[ny][nx] == WALL:
            move[d] = False
            continue

        if any((nx, ny) in s.body for s in game.snakes if s.alive):
            move[d] = False
            continue

        move[d] = True

    return move

# ===== SNAKE =====
class Snake:
    def __init__(self, body, owner=0):
        self.body = body[:]  # list of (x,y)
        self.alive = True
        self.owner = owner
        self.last = []

    def head(self):
        return self.body[0]

# ===== GAME =====
class Game:
    def __init__(self, W, H):
        self.grid = [[EMPTY for _ in range(W)] for _ in range(H)]
        self.snakes = []
        self.energy = []
        self.W = W
        self.H = H
            
    def clone(self):
        import copy
        return copy.deepcopy(self)

    def loadNN(self):
        # --- Réseau NumPy déjà défini ---
        self.net = PolicyNet_Numpy(num_input=24, action_dim=4)

        # Fully connected
        fc1_weight_ = decode_unicode_string_to_weights(fc1_weight, shape=fc1_weight_shape)
        self.net.fc1.weight = fc1_weight_

        fc1_bias_ = decode_unicode_string_to_weights(fc1_bias, shape=fc1_bias_shape)
        self.net.fc1.bias = fc1_bias_

        fc2_weight_ = decode_unicode_string_to_weights(fc2_weight, shape=fc2_weight_shape)
        self.net.fc2.weight = fc2_weight_

        fc2_bias_ = decode_unicode_string_to_weights(fc2_bias, shape=fc2_bias_shape)
        self.net.fc2.bias = fc2_bias_

        fc3_weight_ = decode_unicode_string_to_weights(fc3_weight, shape=fc3_weight_shape)
        self.net.fc3.weight = fc3_weight_

        fc3_bias_ = decode_unicode_string_to_weights(fc3_bias, shape=fc3_bias_shape)
        self.net.fc3.bias = fc3_bias_

        fc4_weight_ = decode_unicode_string_to_weights(fc4_weight, shape=fc4_weight_shape)
        self.net.fc4.weight = fc4_weight_

        fc4_bias_ = decode_unicode_string_to_weights(fc4_bias, shape=fc4_bias_shape)
        self.net.fc4.bias = fc4_bias_

    def Play(self, len_my_snake, my_snake_id, len_opp_snake):
   
        ans = ""
        
        for i in range(len_my_snake):
            # --- Exemple : état du snake ---

            my_snake = self.snakes[i]                 # ton serpent
            my_head = my_snake.head()
            closest_enemy = None
            min_dist = float('inf')

            for j in range(len_my_snake, len_my_snake + len_opp_snake):
                opp = self.snakes[j]
                if not opp.alive:
                    continue
                opp_head = opp.head()
                dist = abs(my_head[0] - opp_head[0]) + abs(my_head[1] - opp_head[1])  # Manhattan
                if dist < min_dist:
                    min_dist = dist
                    closest_enemy = opp

            enemies = []
            if closest_enemy is not None:
                enemies.append(closest_enemy)
                
            energies = self.energy

            state = encode_state_full(my_snake, energies, enemies, self.W, self.H, MAX_LEN=64)
            # state.shape => (24,)

            # --- Passage dans le réseau ---
            q_values = self.net.forward(state)  # shape: (4,)
        
            # --- Epsilon-greedy pour choisir l'action ---
  
            valid_actions = get_movesIA(self, i)  # tu peux filtrer si un mouvement est impossible

            hx, hy = self.snakes[i].head()
            countf = flood_fill_limited(hx, hy, self, 10)
            if countf > 1:
                for j, v in enumerate(valid_actions):
                    if v:
                        hx, hy = self.snakes[i].head()
                        count = flood_fill_limited(hx + DIRS[j][0], hy + DIRS[j][1], self, 10)
                        if count <= 1:
                            valid_actions[j] = False
            
            if is_vertical(self.snakes[i]) and 0<=hx<self.W and 0<=hy-1<self.H and self.grid[hy-1][hx] == EMPTY:
                valid_actions[0] = False

            print("valid_actions =", valid_actions, file=sys.stderr)
            # Masque pour les actions valides
            masked_q = np.copy(q_values)
            for j, valid in enumerate(valid_actions):
                if not valid:
                    masked_q[j] = -1e9
            print("masked =", masked_q, file=sys.stderr)
            action = masked_q.argmax()

            #x, y = game.snakes[i].head()
            #nx, ny = x+DIRS[action][0], y+DIRS[action][1]
            #game.snakes[i].body.insert(0, (nx, ny))
            #game.snakes[i].body.pop()

            ans += str(my_snake_id[i]) + ' ' + DIRECTION[action] + ';'

        print(ans)




def parse_grid(game, height, width, BORDER=0):
    """
    Remplit grid[y][x] depuis l'entrée standard ou une liste de chaînes.
    grid: liste 2D grid[y][x]
    height, width: dimensions
    BORDER: décalage à ajouter aux indices
    WALL et EMPTY doivent être définis
    """
    import sys

    for y in range(height):
        row = input()  # ou row = rows[y] si tu passes une liste de lignes
        print(row, file=sys.stderr)

        for x in range(width):
            if row[x] == '#':
                game.grid[y + BORDER][x + BORDER] = WALL
            else:
                game.grid[y + BORDER][x + BORDER] = EMPTY

def parse_body(s: str, snake, BORDER=0, MAX_BODY=128):
    """
    s: chaîne de la forme "x1,y1:x2,y2:..."
    snake: objet Snake avec attributs body (list), head (int), tail (int), len (int)
    grid: Grid object si tu veux marquer la cellule (optionnel)
    BORDER: valeur à ajouter aux coordonnées
    """
    snake.body = []

    temp = []

    i = 0
    idx = 0
    while i < len(s):
        # --- parse x ---
        sign = 1
        if s[i] == '-':
            sign = -1
            i += 1

        x = 0
        while i < len(s) and s[i].isdigit():
            x = x * 10 + int(s[i])
            i += 1
        x *= sign

        if i < len(s) and s[i] == ',':
            i += 1

        # --- parse y ---
        sign = 1
        if i < len(s) and s[i] == '-':
            sign = -1
            i += 1

        y = 0
        while i < len(s) and s[i].isdigit():
            y = y * 10 + int(s[i])
            i += 1
        y *= sign

        temp.append((x + BORDER, y + BORDER))
        idx += 1

        if i < len(s) and s[i] == ':':
            i += 1

  
    # inverser pour avoir la tête à la fin (comme ton système circulaire)
    snake.body = list(temp)

  
    # optionnel : marquer la grille
    # for b in snake.body:
    #     grid[b[1]][b[0]] = SNAKE

    return True




my_id = int(input())
width = int(input())
height = int(input())
game = Game(width+BORDER, height+BORDER)
game.loadNN()

parse_grid(game, height, width)

snake_player = {}
snakebots_per_player = int(input())
for i in range(snakebots_per_player):
    my_snakebot_id = int(input())
    snake_player[my_snakebot_id] = 0
for i in range(snakebots_per_player):
    opp_snakebot_id = int(input())
    snake_player[opp_snakebot_id] = 1



# game loop
while True:
    power_source_count = int(input())
    game.energy = []
    for i in range(power_source_count):
        x, y = [int(j) for j in input().split()]
        game.energy.append((x+BORDER, y+BORDER))
        game.grid[y+BORDER][x+BORDER] = ENERGY

    snakebot_count = int(input())
    my_snake = []
    opp_snake = []
    my_snake_id = []
    
    for i in range(snakebot_count):
        inputs = input().split()
        snakebot_id = int(inputs[0])
        body = inputs[1]

        snake = Snake([])
        parse_body(body, snake)

        if(snake_player[snakebot_id] == 0):
            my_snake.append(snake)
            my_snake_id.append(snakebot_id)
        else:
            opp_snake.append(snake)

    game.snakes = []
    for s in my_snake:
        game.snakes.append(s)

    for s in opp_snake:
        game.snakes.append(s)

    game.Play(len(my_snake), my_snake_id, len(opp_snake))